<template>
  <div>
    <v-container id="pri">
      <v-card class="gdd">
        <v-card
          style="
            background-color: rgb(255 255 255 / 85%);
            height: 100%;
            overflow: hidden;
            display: flex;
            flex-direction: column;
            justify-content: space-between;
          "
        >
          <v-container style="padding: 20px 20px">
            <div>
              <img style="width: 100%" :src="qaiwan" alt="" />
            </div>
          </v-container>
          <v-container style="text-align: right">
            <div>
              <div style="display: flex; align-items: center; justify-content: center">
                <h1 style="text-align: left; width: 100%">مجمع الجنائن السكني</h1>
                <h3 style="text-align: left; width: 50%">
                  <strong>العدد/ {{ data.contract_id }}</strong>
                </h3>
              </div>
              <br />
              <div style="display: flex; align-items: center; justify-content: center">
                <h3 style="text-align: left; width: 78%">
                  <strong>عقد بيع دار ( {{ data.house_name }} )</strong>
                </h3>
                <h3 style="text-align: left; width: 50%">
                  <strong>التاريخ: {{ data.createdAt }}</strong>
                </h3>
              </div>
              <br />
              <h4>
                <strong>الطرف الاول: البائع </strong>
              </h4>
              <h4>مجموعة شركات قيوان يمثلها وكيل المدير المفوض/ د. حارث رعد حسن</h4>
              <br />
              <h4>الطرف الثاني: ( {{ data.owner_name }} )</h4>
              <h4>
                اتفق الطرف الاول مع الطرف الثاني على بيع دار مشيدة على قطعة الأرض المرقمة
                (..................) مقاطعة ({{ data.house_name }}) والمؤشرة بالتصميم
                الخاص بالموقع وبمساحة ({{ data.house_total_space }} م2) وجنسها ارض سكنية
                بمبلغ اجمالي وقدره ({{ numberWithComma(data.salary_amount) }} $)
                {{ data.salary_amount_written }} دولار امريكي لا غيرها .
              </h4>
              <br />
              <h4 style="color: red">
                1- الدفعة الاولى وقدرها (37,500 $)
                <span style="color: black"
                  >سبعة وثلاثون الف وخمسمائة دولار امريكي لا غير وتعتبر عربون شراء تدفع
                  عند توقيع العقد بتاريخ 21/8/2022 .</span
                >
              </h4>
              <br />
              <ul style="margin-right: 50px; list-style-type: none">
                <li>
                  أ‌- (31,000$) واحد وثلاثون الف دولار امريكي لا غير تعتبر عربون شراء
                  بتاريخ 27/6/2022 .
                </li>
                <li>
                  ب‌- (6,500$) ستة الالف وخمسمائة دولار امريكي لا غير تكملة الدفعة الاولى
                  بتاريخ 21/8/2022 .
                </li>
              </ul>
              <br />
              <h4 style="color: red">
                2- الدفعة الثانية وقدرها (50,000$)
                <span style="color: black"
                  >خمسون الف دولار امريكي لا غير تدفع عند وصول الوحدة السكنية مرحلة انجاز
                  (90%) على ان لاتتجاوز فترة استلام الوحدة السكنية (24) شهراً من تاريخ
                  توقيع العقد .</span
                >
              </h4>
              <br />
              <h4 style="color: red">
                3- الدفعة الثالثة وقدرها (37,500$)
                <span style="color: black"
                  >سبعة وثلاثون الف وخمسمائة دولار امريكي لاغير يسدد بقسط شهري وقدرة
                  (1,250$) الف ومئتان وخمسون دولار امريكي لا غير خلال (سنتين وستة اشهر)
                  مايعادل (30) شهر من تاريخ استلام الوحدة السكنية .</span
                >
              </h4>
              <br />
              <h4 style="color: red">
                ملاحظة :
                <span style="color: black"
                  >اذا تاخر الطرف الثاني عن تسديد اي دفعة من الدفعات خلال (10) ايام من
                  تاريخ التبليغ بالدفع يعتبر العقد ملغي ويتم استقطاع (20%) من مبلغ الوحدة
                  السكنية دون الرجوع الى المحاكم .</span
                >
              </h4>
              <br />
              <h4>
                4- يتم تسليم الوحده السكنيه الى الطرف الثاني وفق المواصفات والمرتسمات
                المتفق عليها.
              </h4>
            </div>
          </v-container>
        </v-card>
      </v-card>
      <v-card class="gdd">
        <v-card
          style="
            background-color: rgb(255 255 255 / 85%);
            height: 100%;
            overflow: hidden;
            display: flex;
            flex-direction: column;
            justify-content: space-between;
          "
        >
          <v-container style="text-align: right">
            <div>
              <h4>
                5- عند تسديد جميع المبالغ المترتبه على المشتري واستلام الوحدة السكنية يقوم
                الطرف الأول بتسليم سند حديث باسم الشركة، بعد تسديد جميع الاقساط الشهرية
                المترتبة على الطرف الثاني في الفقرة (3) من هذا العقد يحول السند باسم الطرف
                الثاني في دائرة التسجيل العقاري عند السماح بذلك من قبل الجهات ذات العلاقة
                وحسب التعليمات والقوانيين الصادرة من الدوائر ذات الصلة .
              </h4>
              <br />
              <h4>
                6- يتحمل الطرف الثاني كافة مصاريف تحويل السند باسمه ومن ضمنها اتعاب
                المحاماة والرسوم والضرائب الخاصة بالمشتري .
              </h4>
              <br />
              <h4>
                7- إذا عدل الطرف الثاني عن الشراء يتم إستقطاع مبلغ غير قابل للرد وقدره(20
                %) من المبلغ الكلي للوحدة السكنية الى الطرف الأول ولا يحق للطرف الثاني
                المطالبة بباقي المبلغ المدفوع لحين بيع الوحدة السكنية الى طرف اخر "ثالث "
                (في حال كان المبلغ المسدد من الطرف الثاني أكثر من 20 %).
              </h4>
              <br />
              <h4>
                8-إذا تلكأ الطرف الثاني عن دفع الاقساط الشهرية ووفق الصيغ المتفق عليها يحق
                للطرف الاول توجيه انذار رسمي صادر من الشركة للطرف الثاني في حال عدم
                استجابة الطرف الثاني للانذار الرسمي وخلال مدة اسبوع يلجأ الطرف الاول الى
                (الفقرة سادساَ من الملحق المرفق مع العقد) وبعدها يحق للطرف الاول التصرف
                بالملك وفق القانون ووفق التعليمات الملحقة في هذا العقد.
              </h4>
              <br />
              <h4>
                9- يقوم الطرف الأول بدفع غرامة تاخيرية وقدرها (500$) خمسمائة دولار عن كل
                شهر ولغاية ١٠ عشرة أشهر كحد أعلى في حال تأخره عن تسليم الوحدة السكنية الى
                الطرف الثاني، تحسب الفترة التأخيرية بعد انتهاء المدة المحددة للتسليم
                والبالغة ٢٤ شهر من تاريخ استلام مبلغ الدفعة الأولى وباستثناء الظروف
                القاهرة.
              </h4>
              <br />
              <h4>
                10-لا يحق للطرف الثاني بيع هذه الوحدة السكنية او التنازل عنها او احداث أي
                تغيير على هذا العقد او عمل أي اجراء معتمد على هذا العقد الا بموافقة
                تحريرية من الطرف الأول وبخلافه يتحمل الطرف الثاني كافة التبعات القانونية.
              </h4>
              <br />
              <h4>
                11- في حال تأخر تسديد الدفعة الثانية لمدة (15 يوم) عن موعدها المحدد يلغى
                العقد ويتم استقطاع 20% من قيمة المبلغ المسدد.
              </h4>
              <br />
              <h4>
                12-تحتسب غرامة تأخيرية بعد (15يوم) عن موعد استحقاق القسط مقدارها (50 $)
                خمسون دولار عن كل يوم تأخير من موعدها المحدد على ان لاتتجاوز الغرامة (90
                يوم ) كحد اعلى وبعدها يعتبر العقد ملغي ويسحب الدار ويتم استرجاع الوحده
                السكنيه .للشركه وتطبق الفقره سادسا من الملحق المرفق مع العقد .
              </h4>
              <br />
              <h4>
                13- ان تغيير العقد يكون حصرا في ادارة الشركة برسوم ادارية مقدارها (2500$)
                تدفع مباشرة عند توقيع العقد الجديد .
              </h4>
            </div>
          </v-container>
        </v-card>
      </v-card>
      <v-card class="gdd">
        <v-card
          style="
            background-color: rgb(255 255 255 / 85%);
            height: 100%;
            overflow: hidden;
            display: flex;
            flex-direction: column;
            justify-content: space-between;
          "
        >
          <v-container style="text-align: right">
            <div>
              <h4>
                14-في حال ايقاف التعامل الدولي بالدولار الامريكي يتم احتساب قيمة العقار
                بما يقابلها من قيمة العملة الجديدة التي سيتم تداولها لاحقا
              </h4>
              <br />
              <h4>
                15- في حال حدوث أي مشكلة او تسبب المشتري بأضرار او تأخير للعمل او تسبب
                بمضايقة ادارة الشركة والكادر الهندسي او الفني , يحق لادارة الشركة فسخ
                العقد دون الرجوع الى المشتري.
              </h4>
              <br />
              <h4>
                16-في حال طلب ىالمشتري اضافه أي مساحه أخرى فوق المخططات الاساسيه للبناء
                تحتسب قيمه الاضافه بقيمه (500$) لكل متر إضافي على ان تتم موافقه المهندس
                المشرف على التغير وان لا تغير الاضافات المخططات الاساسيه للدار واي تغير
                يطلب ولا يثبت تحريريا مع العقد ويصادق من اداره الشركه يكون غير ملزم على
                الشركه .
              </h4>
              <br />
              <h4>
                17-مرفق مع العقد ملحق يتألف من 12 صفحة وهي جزء لا يتجزء من هذا العقد
                وتوقيع الطرف الثاني على صيغة هذا العقد يمثل الموافقة على ماجاء فيهما على
                حد سواء.
              </h4>
              <br />
              <h4>
                18- تعتبر الخارطه جزء لايتجزأ من العقد ويتم اعتماد الواجهه في الخارطه .
              </h4>
              <br />
              <h4>19-كتب وحرر هذا العقد في مدينة الفلوجة . بتاريخ 2022/8/21 .</h4>
            </div>
          </v-container>
          <v-container>
            <v-row
              style="
                display: flex;
                flex-direction: row;
                justify-content: space-evenly;
                align-items: center;
              "
            >
              <v-col cols="6" md="6">
                <h3>
                  <strong> الطرف الثاني</strong>
                </h3>
                <h3>
                  <strong> المشــــــــــــتري</strong>
                </h3>
                <h3>
                  <strong> {{ data.owner_name }}</strong>
                </h3>
                <br />
              </v-col>
              <v-col cols="6" md="6">
                <h3>
                  <strong>الطرف الاول</strong>
                </h3>
                <h3>
                  <strong> البائع/مجموعة شركة قيوان يمثلها</strong>
                </h3>
                <h3>
                  <strong>د . حارث رعــــد حســـــن</strong>
                </h3>
                <br />
              </v-col>
            </v-row>
            <br />
            <br />
            <br />
            <br />
            <v-row
              style="
                display: flex;
                flex-direction: row;
                justify-content: space-evenly;
                align-items: center;
              "
            >
              <v-col cols="6" md="6">
                <h3>
                  <strong> الشاهد الاول</strong>
                </h3>
                <br />
                <br />
              </v-col>
              <v-col cols="6" md="6">
                <h3>
                  <strong>الشاهد الثاني </strong>
                </h3>
                <br />
                <br />
              </v-col>
            </v-row>
          </v-container>
        </v-card>
      </v-card>
      <v-card class="gdd">
        <v-card
          style="
            background-color: rgb(255 255 255 / 85%);
            height: 100%;
            overflow: hidden;
            display: flex;
            flex-direction: column;
            justify-content: space-between;
          "
        >
          <v-container style="padding: 20px 20px">
            <div>
              <img style="width: 100%" :src="qaiwan" alt="" />
            </div>
          </v-container>
          <v-container style="text-align: right">
            <div>
              <div style="display: flex; align-items: center; justify-content: center">
                <h1 style="text-align: left; width: 100%">بسم الله الرحمن الرحيم</h1>
                <h3 style="text-align: left; width: 50%">
                  <strong>العدد/ {{ data.contract_id }}</strong>
                </h3>
              </div>
              <br />
              <div style="display: flex; align-items: center; justify-content: center">
                <h3 style="text-align: left; width: 78%">
                  <strong>ملحق عقد بيع دار ( {{ data.house_name }} )</strong>
                </h3>
                <h3 style="text-align: left; width: 50%">
                  <strong>التاريخ: {{ data.createdAt }}</strong>
                </h3>
              </div>
              <br />
              <h4>
                <strong>الطرف الاول: </strong>
              </h4>
              <h4>مجموعة شركات قيوان يمثلها وكيل المدير المفوض / د. حارث رعد حسن.</h4>
              <br />
              <h4>الطرف الثاني:</h4>
              <h4>
                <strong>( {{ data.owner_name }} )</strong>
              </h4>
              <h4>مقدمة توضحية للعقد:</h4>
              <br />
              <h4>
                حيثما ذكر الطرف الاول ، البائع ، الشركة البائعة ، صاحب الامتياز ، مالك
                المشروع ، صاحب المشروع ، الطرف المنفذ ،الشركة المنفذة ، مجموعة شركات قيوان
                ضمن سياق هذا العقد او اي كلمة دلالية مقاربة فأنها تعني مجموعة شركات قيوان
                حيثما ذكر الطرف المشتري الجهة المشترية ضمن سياق هذا العقد او اي كلمة
                دلالية مقاربة فانها تعني الطرف الثاني بموجب هذا العقد بيع العقار- نوع
                الوحده (..................... ) رقمها ( {{ data.house_name }} ) الواقع ضمن
                الحي السكني لمجمع الجنائن الذي ينفذه مجموعة شركات قيوان في الفلوجة الى
                الطرف الثاني بعد قيام الطرف الثاني تسجيله تسجيلا اولا على صنف العقار ضمن
                الاصناف التي توفرها الشركة ، وبعد معاينة الطرف الثاني لنموذج العقار على
                الطبيعة وذلك حسب الشروط والمواصفات والمخططات وتفاصيل العقد والمرفق بها
                والتي جميعها تعتبر جزءاً لا يتجزأ من العقد وملزماً الزاماً تاماً للطرفين
                المتعاقدين .
              </h4>
              <br />
              <h4>
                وكما ان الطرف الثاني وعند توقيعه لهذا العقد فانه يقر اقرارا تاماً بعلمه
                بان مايقوم بشرائه هو قطعة الارض المحددة في عقد الارض والمنزل المحدد في عقد
                المنزل وملحقه ، والمعروفة مجتمعة بالعقار المباع ، وانه يشتري فقط ذلك
                العقار دون ان تكون له اي ملكية على اي من
              </h4>
            </div>
          </v-container>
        </v-card>
      </v-card>
      <v-card class="gdd">
        <v-card
          style="
            background-color: rgb(255 255 255 / 85%);
            height: 100%;
            overflow: hidden;
            display: flex;
            flex-direction: column;
            justify-content: space-between;
          "
        >
          <v-container style="text-align: right">
            <div>
              <h4>
                المرافق العامة ضمن المشروع والتي هي على سبيل المثال لا الحصر – الارصفة
                والشوارع والمنتزهات العامة ومدن الالعاب والمدراس والمستشفيات ومحطات الوقود
                بكافة انواعه والاسواق التجارية ومحطات الماء والكهرباء و المجاري ومتعلقاتها
                من انابيب واسلاك الخ.. وان اقراره يتضمن معرفته بان عائدية جميع هذه المرافق
                تعود الى الطرف الاول والصالح العام وليس له الحق مطلقاً في استخدامها بشكل
                مخالف لما سيتم ذكره في سياق العقد او ادعائه ملكيتها امام المحاكم او الجهات
                ذات الاختصاص وللطرف الثاني استخدام جميع هذه المرافق الخدمية مادام يقوم
                بأستخدامها بالطريقة القانونية دون الاضرار بالصالح العام.
              </h4>
              <br />
              <h4>
                <strong>يتضمن هذا العقد الكلي اربعة عقود جزئية هي كالتالي:</strong>
              </h4>
              <br />
              <ul style="list-style-type: none; margin-right: 37px">
                <li>١-عقد المنزل المشيد ملحق به مواصفات المنزل الفنية وطريقة الدفع.</li>
                <li>٢-عقد الارض المقام عليها المنزل.</li>
                <li>٣-عقد الخدمات.</li>
                <li>٤-العقد الاجتماعي.</li>
              </ul>
              <br />
              <h4>
                وبتوقيع الطرف الثاني على اي من هذه العقود مجتمعة او منفردة فانه بذلك يعتبر
                قد وافق عليها جميعا ضمنا حيث تعتبر هذه العقود والملاحق الفنية والمقدمة
                بالاضافة الى جميع الصور والمخططات الملحقة واي وثيقة رسمية او فنية او
                تصويرية جزأً لايتجزأ من هذا العقد والتوقيع على اي منها يعني الموافقة عليها
                جميعا.
              </h4>
              <br />
              <h4>
                <strong>عقد المنزل المشيد ملحق المواصفات العامة للبناء</strong>
              </h4>
              <br />
              <h4>
                اولا-تقوم مجموعة شركات قيوان بالبناء بالطريقة التقليدية (الطابوق والاسمنت)
                وبأشراف هندسي عراقي متخصص وبكوادر ذات كفاءة عالية وخبرات طويلة وبالمواصفات
                العراقية المعتمدة.
              </h4>
              <br />
              <h4>
                <strong>ملاحظات هامة</strong>
              </h4>
              <br />
              <h4>
                1-يقوم الطرف الثاني بتسديد المبلغ في حساب معتمد يفتح بأسم المشروع في مصرف
                معتمد من الطرف الاول ويستلم اشعار رسمي من المصرف بذلك وجلبة الى مقر الشركة
                لتوثيق التسديد
              </h4>
              <br />
              <h4>
                2-يلتزم الطرف الاول بتبليغ الطرف الثاني بموعد استحقاق القسط التالي قبل
                عشرة ايام من تأريخ استحقاق الدفع.
              </h4>
              <br />
              <h4>
                3-يلتزم الطرف الثاني بالتسديد خلال الفترة المقررة لاستحقاق القسط او خلال
                فترة السماح القانونية وهي اسبوع واحد من تأريخ انتهاء المدة الأصلية المقررة
                للسداد
              </h4>
            </div>
          </v-container>
        </v-card>
      </v-card>
      <v-card class="gdd">
        <v-card
          style="
            background-color: rgb(255 255 255 / 85%);
            height: 100%;
            overflow: hidden;
            display: flex;
            flex-direction: column;
            justify-content: space-between;
          "
        >
          <v-container style="text-align: right">
            <div>
              <h4>
                4-تقوم الشركة بصيانة العيوب الفنية في المنزل والناتجة عن خلل في التنفيذ
                والغير ناتجة عن سوء استخدام او محاولة تغيير او اضافة من الطرف الثاني
                ولاتشمل الخلل في الانارة او الاجهزة الكهربائية ولمدة ستة أشهر بعد تسليم
                المنزل تسليما هندسيا الى الطرف الثاني.
              </h4>
              <br />
              <h4>
                5-للشركة الحق في تغيير موقع الوحدة السكنية المباعة الى موقع اخر على ان
                تكون بنفس المواصفات إذا اقتضت الضرورة لاسباب فنية وهندسية، وإذا كان ذلك
                فيه خدمة للصالح العام والمجمع السكني وابلاغ الطرف الثاني بذلك قبل بدء
                التغير وحسب مقتضيات الامر.
              </h4>
              <br />
              <h4>
                <strong>عقد الخدمات</strong>
              </h4>
              <br />
              <h4>
                يقصد بعقد الخدمات الإطار القانوني للحقوق والواجبات للطرفين المتعاقدين
                والذي بموجبه يلتزم الطرف الاول بتقديم مجموعة من الخدمات الاساسية (والتي
                سيأتي ذكرها لاحقاً في العقد) مقابل عائد مادي معين، حيث يتعد الطرف الاول
                باستمراره في تقديم هذه الخدمات والعمل على ديمومتها، وفي المقابل يتعهد
                الطرف الثاني بدفع المستحقات المترتبة على استخدامه لهذه الخدمات وكذلك يتعهد
                بعدم الاضرار بهذه الخدمات، كذلك يتعهد بعدم الاضرار بهذه الخدمات بأي شكل او
                التجاوز عليها بصوره غير قانونية.
              </h4>
              <br />
              <h4>
                <strong>مقدمة:</strong>
              </h4>
              <br />
              <h4>
                يمتلك الطرف الاول عددا من المؤسسات والمشاريع التي تقدم خدمات اساسية مختلفة
                في المشروع المسمى مشروع الجنائن السكني والكائن في مدينة الفلوجة -محافظة
                الانبار-العراق (مشروع استثماري حسب الشهادة الاستثمارية رقم ٣٩ والصادرة عن
                هيئة استثمار الانبار) وقام الطرف الثاني بالاطلاع على طبيعة هذه الخدمات
                ووافق على انه بشرائه لوحدة سكنية ضمن هذا المشروع فانه يلتزم بشروط هذا
                العقد وابدى رغبته في الاستفادة من الخدمات التي يقدمها الطرف الاول والتي
                تشمل كل من:
              </h4>
              <br />
              <ul>
                <li>1-الكهرباء.</li>
                <li>2-الماء الصافي.</li>
                <li>3-الصرف الصحي والمجاري.</li>
                <li>4-الانترنيت.</li>
              </ul>
              <br />
              <h4>
                لذا فقد اتفق الطرفان وهما بكامل الاهلية المعتبرة شرعاً وقانوناً على مايلي:
                -
              </h4>
              <br />
              <h4>
                <strong>1-الكهرباء:</strong>
              </h4>
              <h4>
                <strong>1-1 التزامات الطرف الاول:</strong>
              </h4>
              <br />
              <h4>
                أ-يتعهد الطرف الاول بمد شبكة خطوط نقل الطاقة الكهربائية في كافة اجزاء
                المجمع السكني تراعي اعلى شروط السلامة والامان المعتمدة عالميا، وتصل الى كل
                وحدة سكنية في المشروع دون استثناء.
              </h4>
            </div>
          </v-container>
        </v-card>
      </v-card>
      <v-card class="gdd">
        <v-card
          style="
            background-color: rgb(255 255 255 / 85%);
            height: 100%;
            overflow: hidden;
            display: flex;
            flex-direction: column;
            justify-content: space-between;
          "
        >
          <v-container style="text-align: right">
            <div>
              <h4>
                <strong>1-2 التزامات الطرف الثاني</strong>
              </h4>
              <br />
              <h4>
                يتعهد الطرف الثاني بدفع كافة مستحقاته المالية والتي يقررها الطرف الاول
                وتقرها الجهات الحكومية المختصة كالتالي:
              </h4>
              <br />
              <h4>
                أ-دفع كامل مبلغ قائمة الكهرباء المترتبة عليه بحساب كيلو واط / ساعة او
                بالامبير وبالسعر الذي تحدده الجهات الحكومية المختصة وبما تراه الشركة
                مناسبا لها.
              </h4>
              <br />
              <h4>
                ب -يتعهد بعدم تجاوزه على الشبكة الكهربائية مطلقاً وبأي شكل من الاشكال،
                كالتلاعب بماقيس الطاقة او التجاوز ومد خطوط من الشبكة بصورة مباشرة وبدون
                موافقة ادارة المشروع او اي تجاوز اخر يضر بالمشروع.
              </h4>
              <br />
              <h4>
                ج-يتعهد بعدم تمديد اي خط للكهرباء من خارج الحي السكني ولاي سبب من الاسباب.
              </h4>
              <br />
              <h4>
                هـ -يتعهد بعدم العبث بخطوط نقل الطاقة او القيام متعمدا بأي عمل يؤدي الى
                الاضرار بالشبكة او وحدات التوليد بأي شكل من الاشكال كالحفر بالقرب من
                الخطوط او تكوين دائرة كهربائية قصيرة او اي عمل اخر.
              </h4>
              <br />
              <h4>
                و-يتعهد بعدم مد خط للطاقة الكهربائية الى خارج المشروع السكني ولاي سبب من
                الاسباب.
              </h4>
              <br />
              <h4>
                ز-يتعهد بعدم مد خط للطاقة الكهربائية من او الى اي وحدة سكنية اخرى ضمن
                المشروع دون موافقة مالك الوحدة السكنية الثانية وإدارة المشروع.
              </h4>
              <br />
              <h4>
                ي. يتعهد بعدم استقدام اي شخص للقيام بعمليات الصيانة دون الرجوع الى الشركة
                المشغلة للمشروع.
              </h4>
              <br />
              <h4>
                <strong>2-الماء</strong>
              </h4>
              <h4>
                <strong>2-1 التزامات الطرف الاول:</strong>
              </h4>
              <br />
              <h4>
                يقوم الطرف الاول بمد شبكة انابيب الماء الصافي في كافة اجزاء المجمع السكني
                تراعي اعلى شروط السلامة والامان والصحة المعتمدة عالميا، وتكون هذه الشبكة
                ارضية (تحت الارض) وتصل الى كل وحدة سكنية في المشروع دون استثناء.
              </h4>
            </div>
          </v-container>
        </v-card>
      </v-card>
      <v-card class="gdd">
        <v-card
          style="
            background-color: rgb(255 255 255 / 85%);
            height: 100%;
            overflow: hidden;
            display: flex;
            flex-direction: column;
            justify-content: space-between;
          "
        >
          <v-container style="text-align: right">
            <div>
              <h4>
                <strong>2-2 التزامات الطرف الثاني</strong>
              </h4>
              <br />
              <h4>
                يتعهد الطرف الثاني بدفع كافة مستحقاته المالية والتي يقررها الطرف الاول وهي
                كالتالي:
              </h4>
              <br />
              <h4>
                1-دفع كامل مبلغ قائمة الماء المترتبة عليه وبالسعر الذي تحدده الجهات
                الحكومية المختصة، وبما تراه الشركة مناسبا.
              </h4>
              <br />
              <h4>
                أ-يتعهد بعدم تجاوزه على شبكة انابيب نقل المياه مطلقا وبأي شكل من الاشكال،
                التجاوز كمد انابيب من الشبكة بصورة مباشرة وبدون موافقة ادراة المشروع او اي
                تجاوز اخر يضر المشروع.
              </h4>
              <br />
              <h4>
                ب-يتعهد بعدم مد اي انبوب لنقل المياه من خارج الحي السكني ولاي سبب من
                الاسباب.
              </h4>
              <br />
              <h4>
                ج-يتعهد بعدم ادخال مضخات المياه الكهربائية او التي تعمل بالوقود
                (الماطورات) الى الحي مطلقا الا بموافقة ادارة المشروع وشريطة ان لايتم
                تشغليها داخل حدود المشروع او ربطها على شبكة انابيب مياه المشروع مطلقاً.
              </h4>
              <br />
              <h4>
                د-يتعهد بعدم العبث بخطوط بشبكة الانابيب او القيام متعمدا بأي عمل يؤدي الى
                الاضرار بالشبكة بأي شكل من الاشكال كالحفر بالقرب من الانابيب او التلاعب
                بها او اي عمل اخر.
              </h4>
              <br />
              <h4>
                و-يتعهد بعدم مد خط انابيب لنقل المياه الى خارج المشروع السكني ولاي سبب من
                الاسباب.
              </h4>
              <br />
              <h4>
                ح-يتعهد بعدم مد خط انابيب مياه من او الى اي وحدة سكنية اخرى ضمن المشروع
                دون موافقة مالك الوحدة السكنية الثانية.
              </h4>
              <br />
              <h4>
                ج-في حال اضرارالمستفيد بأي جزء من اجزاء شبكة الانابيب، أنبوب النقل الرئيسي
                او محطة التصفية فأن الشركة تحتفظ بحقها باجبار المتجاوز بدفع غرامة تعادل
                ضعف تكاليف رفع اصلاح الضرر من قبل الشركة، بالاضافة الى تغريمه جميع خسائر
                الشركة الناتجة عن انقطاع الماء الصالح للشرب عن اي وحدة سكنية كنتيجة مباشرة
                او غير مباشرة للاضرار الناتجة عن افعاله وتوقيع المتجاوز على تعهد بعدم
                تكرار تجاوزه، وفي حالة التكرار تضاعف الغرامات عن اخر غرامة.
              </h4>
            </div>
          </v-container>
        </v-card>
      </v-card>
      <v-card class="gdd">
        <v-card
          style="
            background-color: rgb(255 255 255 / 85%);
            height: 100%;
            overflow: hidden;
            display: flex;
            flex-direction: column;
            justify-content: space-between;
          "
        >
          <v-container style="text-align: right">
            <div>
              <h4>
                س-في حالة تجاوز المخالفات لثلاث مرات يكون للشركة الحق اقامة دعوى قضائية ضد
                المتجاوز.
              </h4>
              <br />
              <h4>
                <strong>3-الصرف الصحي والمجاري:</strong>
              </h4>
              <br />
              <h4>
                <strong>3-1 التزامات الطرف الاول:</strong>
              </h4>
              <h4>
                يتعهد الطرف الاول بمد شبكة أنابيب للصرف الصحي والمجاري، ومياه الامطار في
                كافة اجزاء المجمع السكني تراعي اعلى شروط السلامة والامان والصحة المعتمدة
                عالمياً، وتكون هذه الشبكة ارضية (تحت الارض) وتصل الى كل وحدة سكنية في
                المشروع دون استثناء.
              </h4>
              <br />
              <h4>
                <strong>3-2 التزامات الطرف الثاني:</strong>
              </h4>
              <h4>
                أ‌- يتعهد الطرف الثاني بدفع كافة مستحقاته المالية والتي تقررها الجهات
                الحكومية المختصة.
              </h4>
              <br />
              <h4>
                ب – يتعهد بعدم تجاوزه على شبكة انابيب نقل المياه العادمة وبأي شكل من
                الاشكال، كالتلاعب او التجاوز ومد الانابيب من الشبكة بصورة مباشرة وبدون
                موافقة ادارة المشروع او اي تجاوز اخر يضر بالمشروع او رمي اي مواد في الشبكة
                تضر بها او تخالف شروط الصحة والسلامة كالكيمياويات والنفايات الصلبة الكبيرة
                التي تؤدي الى تسدد الانابيب او المواد والعوامل البيولوجية او الملوثات
                الصناعية او المواد القابلة للاشتعال او الانفجار الخ...
              </h4>
              <br />
              <h4>
                ج-يتعهد بعدم مد اي انبوب لنقل مياه العادمة من او الى خارج الحي السكني ولاي
                سبب من الاسباب.
              </h4>
              <br />
              <h4>
                د-يتعهد بعدم حفر اي احواض تعفين داخل الوحدة السكنية او قيامه بالتخلص من
                المياه العادمة بأي شكل اخر غير رميها في الشبكة المخصصة او تحويلها الى شبكة
                منزل مجاور لاي سبب من الاسباب.
              </h4>
              <br />
              <h4>
                <strong
                  >عقد الخدمات البلدية والاستخدام العادل للمرافق العامة والادارة المحلية
                  والعقد الاجتماعي</strong
                >
              </h4>
              <h4>
                <strong>1-الخدمات البلدية والاستخدام العادل للمرافق العامة</strong>
              </h4>
              <br />
              <h4>مقدمة:</h4>
              <br />
              <h4>
                يقصد بالخدمات البلدية مجموعة الاعمال التي تقدمها الشركة والتي تضمن الحفاظ
                على نظافة الحي ومطابقته للشروط الصحية للتجمعات السكنية ، كما تشمل خدمات
                صيانة الطرق والمجاري والمتنزهات والاماكن العامة بالشكل الذي يضمن سلامة هذه
                المرافق وادائها للغرض المنشأة لاجله على أكمل وجه ممكن ،تعتبر جميع هذه
                المرافق والمواقع ملكا خاصا للطرف الاول مجموعة شركات قيوان ، ويحق للمستفيد
                ( مالكي الوحدات وعائلاتهم وضيوفهم) استخدام هذه
              </h4>
            </div>
          </v-container>
        </v-card>
      </v-card>
      <v-card class="gdd">
        <v-card
          style="
            background-color: rgb(255 255 255 / 85%);
            height: 100%;
            overflow: hidden;
            display: flex;
            flex-direction: column;
            justify-content: space-between;
          "
        >
          <v-container style="text-align: right">
            <div>
              <h4>
                المرافق وتطبق سياسة الاستخدام العادل الذي يضمن راحة المستخدم وفي الوقت
                ذاته يوجب عدم اضرار المستخدم لهذه المرافق ، كما يوجب عليه دفع مبالغ رمزية
                لصيانة هذه المرافق وضمان ديمومتها للوقت المنشأة لاجله.
              </h4>
              <br />
              <h4>
                1- تقوم الشركة بتوفير حاويات للنفايات لكل وحدة سكنية ان أمكن وحسب الاسعار
                السائدة او على حساب الطرف الثاني، وحسب ماترتأيه الشركة مناسبا وفي حالة
                اصابة هذه الحاوية بأي اضرار يتم تغريم الحاوية من المستفيد.
              </h4>
              <br />
              <h4>
                2- تتعهد الشركة بتوفير سيارة للنفايات تقوم برفع النفايات مقابل مبلغ قدره
                يتفق عليه مقطوعة شهرياً على ان لايقل عن خمسة وثلاثون ألف 35000 شهريا.
              </h4>
              <br />
              <h4>
                3- يمنع مطلقاً رمي النفايات في غير هذه الحاويات بالنسبة للمنازل، وفي
                الحاويات التي تنشر في الاماكن العامة، ويتم تغريم كل شخص يقوم برمي النفايات
                غرامة تقررها الادارة المحلية حسب نوع النفايات والتكرار.
              </h4>
              <br />
              <h4>
                4- يمنع منعاً باتاً رمي اعقاب السكائر في الاماكن العامة الا في الاماكن
                المخصصة للنفايات وتعامل كأي نفايات اخرى.
              </h4>
              <br />
              <h4>
                5- يمنع منعاً باتاً تعاطي المشروبات الكحولية في الاماكن العامة، ويشمل ذلك
                تعاطي المشروبات الكحولية في الحدائق والمنتزهات واماكن التسوق ومدن الالعاب
                والمدارس الى اخره من الاماكن العامة المغلقة والمفتوحة، ويعرض المخالف نفسه
                للمسألة القانونية وبتوقيعه على هذا العقد يفهم الطرف الثاني فهماً تاماً
                يوافق على ان تقوم الجهات المختصة بتطبيق قانون العقوبات بحقه ومن حق الشركة
                تقديم طلب رسمي بالحصول على تعهد خطي بعدم تكرار المخالفة.
              </h4>
              <br />
              <h4>
                6- يمنع منعا باتا تعاطي المواد المخدرة في الحي، ويعرض المخالف نفسه
                للعقوبات القانونية حسب القوانين السارية.
              </h4>
              <br />
              <h4>
                7- يمنع منعا باتا وضع الملصقات واللافتات الدعائية، سواء اللافتات والدعايات
                التجارية او الانتخابية او غيرها، في الاماكن العامة او على واجهات وجدران
                المنازل الا بموافقة خطية من صاحب ذلك المنزل وادارة المجمع، ويعرض المخالف
                نفسه لعقوبة رفع اللافتات وعقوبات اخرى تفرضها الادارة المحليةوستقوم الشركة
                بتخصيص اماكن معينة لوضع الاعلانات والملصقات.
              </h4>
              <h4>
                8- يمنع منعا باتا اغلاق الشوارع او المناطق العامة لاقامة الاحتفالات او
                المناسبات او مجالس العزاء دون موافقة اهالي المجمع والادارة المحلية.
              </h4>
              <h4>
                9- يمنع منعا باتا الحفر و/ او وضع المطبات في الشوارع والمناطق العامة لاي
                سبب كان، ويتحمل المخالف غرامة تعادل ضعف مبلغ رفع التجاوز.
              </h4>
              <h4>
                10- يمنع منعا باتا التلاعب بأي من الاجهزة او الموجودات العمومية مثل مصابيح
                الانارة في الشوارع والمنتزهات او الهواتف العمومية او صنابير الماء العمومية
                الخ.... ويتحمل المخالف غرامة تعادل ضعف تكلفة اصلاح اي عطب يتسبب به.
              </h4>
            </div>
          </v-container>
        </v-card>
      </v-card>
      <v-card class="gdd">
        <v-card
          style="
            background-color: rgb(255 255 255 / 85%);
            height: 100%;
            overflow: hidden;
            display: flex;
            flex-direction: column;
            justify-content: space-between;
          "
        >
          <v-container style="text-align: right">
            <div>
              <h4>
                11- في حالة حصول اي ضرر في المرافق العامة نتيجة لعمل غير معتمد من قبل
                المستفيد فأنه يتحمل كلفة إصلاح ذلك العطب او الضرر.
              </h4>
              <br />
              <h4>
                12- يتم تحديد السرعة القصوى للقيادة داخل المجمع ب ٣٠كم في الساعة، ويتحمل
                المخالف غرامة تفرض من الادراة المحلية تبعا للضروالتكرار، وتتحمل الشركة وضع
                الشواخص والعلامات المرورية المطلوبة.
              </h4>
              <br />
              <h4>
                13- يمنع منعا باتا ادخال الحيوانات الداجنة الى داخل الحي كالأبقار والأغنام
                والدواجن والحمام الخ...، ويستثنى من ذلك طيور الزينة المحتجزة في اقفاص،
                القطط، الكلاب المحتجزة داخل المنازل والمقيدة برسن، شرط موافقة الجيران وعدم
                ازعاجهم.
              </h4>
              <br />
              <h4>
                14- يمنع منعا باتا ازعاج الجيران برفع الاصوات ويتحمل المخالف غرامة تفرضها
                الادراة المحلية في حالة تكرار الشكوى من قبل الجيران لاكثر من ثلاث مرات.
              </h4>
              <br />
              <h4>
                15- يمنع التعدي بالكلام او الفعل على اي شخص داخل المجمع لاي سبب ويتحمل
                المخالف الغرامة المفروضة من قبل الادارةالمحلية.
              </h4>
              <br />
              <h4>16- يمنع منعا باتا القيام بغسل السيارات في الشوارع والاماكن العامة.</h4>
              <br />
              <h4>
                17- يمنع منها باتاً بيع الوقود (الغاز – الكاز -النفط – البنزين) او اي وقود
                اخر في الاماكن العامة ويتم تغريم المخالف حسب ماتقرره والادارة المحلية
                ومصادرة الوقود.
              </h4>
              <br />
              <h4>
                18- يمنع منعاً باتاً بيع اية بضائع في الشوارع والاماكن العامة بشكل عربات
                متنقلة او (بسطات) الابترخيص من الادارة المحلية، ومن الجهات الصحية المختصة
                في حالة بيع مواد غذائية (اطعمة – مأكولات – مرطبات) الخ....
              </h4>
              <br />
              <h4>
                19- يمنع منعاً باتاً ذبح الحيوانات فيالاماكن العامة، ويتحمل المخالف غرامة
                تفرضها عليه الادارة المحلية.
              </h4>
              <br />
              <h4>
                20- يمنع ادخال الشاحانات وسيارات الحمل الكبيرة الى داخل المشروع وفي حالة
                ادخالها لضرورة تقررها ادارة المشروع يمنع مبيت هذه الشاحانات داخل المشروع.
              </h4>
              <br />
              <h4>
                <strong>2-الادراة المحليه </strong>
              </h4>
              <br />
              <h4>
                يتم تشكيل هيئة لادراة المجمع من قبل شركة قيوان تقدم لها الشركة مقرا ثابتا
                في المجمع السكني، تكون هذه الهيئة مسؤولة عن متابعة تنفيذ التعهدات لكل من
                المستفيد والشركة كما وتشرف على ادراة المجمع السكني ومتابعة تنفيذ الخدمات
                فيه، تطبيق العقوبات، استحصال الغرامات، دفع الاجور للعاملين، متابعة سير
                الامور في المجمع وايصال الشكاوى الى الشركة وتقوم هذه الهيئة بدورها باستلام
                الاقتراحات والشكاوى من ساكني المجمع.
              </h4>
            </div>
          </v-container>
        </v-card>
      </v-card>
      <v-card class="gdd">
        <v-card
          style="
            background-color: rgb(255 255 255 / 85%);
            height: 100%;
            overflow: hidden;
            display: flex;
            flex-direction: column;
            justify-content: space-between;
          "
        >
          <v-container style="text-align: right">
            <div>
              <h4>
                1- يتعهد جميع الساكنين بموافقتهم على اعتبار الادراة المحلية الجهة الوحيدة
                الرسمية المؤهلة لادارة المجمع السكني وموافقتهم على قراراتها.
              </h4>
              <br />
              <h4>2- يتعهد جميع الساكنين باتباعهم لتوجيهات وتعليمات الادارة المحلية.</h4>
              <br />
              <h4>
                3- يتعهد جميع الساكنين بالتوجه بعرض شكواهم ونزاعاتهم ومشاكلهم الى الادارة
                المحلية لحلها قبل عرضها على الجهات المختصة سواء الحكومية او الشركة المالكة
                للمشروع (مبدأ التكافل الاجتماعي).
              </h4>
              <br />
              <h4>
                4- يتعهد جميع الساكنين بتطبيق العقوبات ودفع الغرامات التي تفرضها الادراة
                المحلية، وفي حالة عدم موافقتهم بامكانهم طلب المراجعة وتوضيح موقفهم وفي
                حالة عدم موافقتهم على اي قرار بعد المراجعة يتم عرض الموضوع محل الخلاف على
                هيئة الملاك نهائياً.
              </h4>
              <br />
              <h4>
                5- تقوم الادارة بمناقشة الزيادة في اجور الخدمات المذكورة في هذا العقد في
                حالة التضخم او زيادة المصاريف، وعرضها على الساكنين ويتعهد الساكنين
                بموافقتهم على هذه الزيادات.
              </h4>
              <br />
              <h4>
                <strong>3- الالتزامات الادارية</strong>
              </h4>
              <br />
              <h4>
                1- ويقر الطرف الثاني بقبوله بأن هذا البيع مرتبط (ببناء) الوحدة السكنية
                التي قرر شرائها ، باعتبار البناء والارض وحدتين منفصلتين بعقدين منفصلين
                كيانا ومجتمعين ضمن العقد الكلي ويعتبر كلاهما جزءاً لايتجزأ من العقد الكلي
                ، ويقر بانه قام بشراء الارض فقط لغرض أنشاء الوحدة السكنية المتفق عليها في
                عقد البناء على الارض المذكورة في عقد الارض ،ويقر بانه اطلع على قطعة الارض
                التي خصصتها هيئة الاستثمار للشركة واطلع على كافة حدود ومواصفات الارض التي
                يروم شراء المنزل فيها اطلاعا نافيا للجهالة ، و وافق على جميع الخرائط
                والمساقط والمخططات المذكورة سابقاً.
              </h4>
              <br />
              <h4>
                2- يقوم الطرف الاول بتسليم الوحدة محل العقد الكلي (أرض وبناء) الى الطرف
                الثاني بحسب المدة التي يتفق عليها الطرفان الا في حالات الظروف القاهرة.
              </h4>
              <br />
              <h4>
                3- يقر الطرف الثاني بأنه يفهم تماما بأنه لن يستلم قطعة ارض قضاء وانما هذا
                العقد مرتبط ارتباطا تاما بالعقود الاخرى التي تشكل مع هذا العقد مجتمعة
                العقد الكلي، وانه تم بيع الارض له لغرض حصوله على سند ارض يحصل من خلاله على
                قرض من اية جهة حكومية يتم الاتفاق عليها، مع بقاء الارض محجوزة ومعلمة
                بعلامة الحجز في دائرة التسجيل العقاري لحين تسديد المستفيد لكامل التزاماته
                المالية، وفي حالة اخلاله بهذه الفقرة فانه يعرض نفسه للعقوبات والغرامات
                التالية: -
              </h4>
              <br />
              <h4>
                أ‌- -في حالة قيام المشتري بمنع الشركة او محاولة منعها من بناء الوحدة
                السكنية المتفق عليها في عقد البناء المرافق لهذا الملحق ، سواء كان هذا
                المنع باستخدام القوة او اللجوء الى القانون او تخريب الاعمال الارضية الى
                اخره من وسائل المنع والتعطيل فأن الشركة لها الحق في مصادرة كامل المبالغ
                المدفوعة من قبله ، اضافة لدفعه لغرامة تعادل نصف القيمة الكلية للوحدة
                المتفق عليها في عقد البناء مع احتفاظ الشركة بحقها في ابقاء الحجز على تلك
                الارض.
              </h4>
            </div>
          </v-container>
        </v-card>
      </v-card>
      <v-card class="gdd">
        <v-card
          style="
            background-color: rgb(255 255 255 / 85%);
            height: 100%;
            overflow: hidden;
            display: flex;
            flex-direction: column;
            justify-content: space-between;
          "
        >
          <v-container style="text-align: right">
            <div>
              <h4>
                ب‌- في حالة قيام المشتري ببيع الارض موضوع العقد الى اي طرف ثالث كأرض فضاء
                فأنه يتحمل العقوبات المذكورة في الفقرة اعلاه وحتى لو قام الطرف الثالث
              </h4>
              <h4>
                المشتري للارض بدفع المتبقي من قيمة الوحدة فان العقوبات ستستمر بحق الطرف
                المشتري الاصلي.
              </h4>
              <br />
              <h4><strong>4- (التنازل ونقل الملكية وتغيير صنف الملكية)</strong></h4>
              <br />
              <h4>
                1- لايحق للطرف الثاني التصرف في الوحدة موضوع هذا العقد (ارضاً وبناء) الا
                بعد قيامه بالوفاء بجميع مستحقات الطرف الاول في الدفعات المشار اليها اعلاه،
                حيث تعتبر الوحدة السكنية (ارض وبناء) مثقلة بها ومرهونة لصالح الطرف الاول
                حتى تمام الوفاء بكامل قيمتها، ولا يحق للطرف الثاني القيام بالتنازل عن هذا
                العقد او اي من التصرفات الاخرى الا بعد الحصول على موافقة خطية بذلك من
                الطرف الاول.
              </h4>
              <br />
              <h4>
                2- لايحق للطرف الثاني اجراء اي تعديل على الارض يؤدي الى الاضرار بالمنازل
                المجاورة او المشروع ككل كرفع مستوى ارض او الحفر او انشاء مسابح او بركة
                سباحة غير مطابق للمواصفات الخ...
              </h4>
              <br />
              <h4>
                3- لايحق للطرف الثاني التغير الكلي او الجزئي في بناء المنزل او الخدمات
                التي توفرها الشركة في المنزل الا بعد مرور خمس سنوات من انجاز المشروع الكلي
                ويستثنى من ذلك الصحيات الخارجية في حالة قيام المستفيد بتقديم طلب رسمي الى
                الشركة المشغلة للمشروع وهي الجهة التي تقوم بهذا التغيير للمستفيد وبالاجور
                المحلية في حال توفر الامكانية لدى الشركة على ان لاتقوم الشركة بالمضاربة في
                هذا التغيير واستيفاء اجور العمل ومواد البناء فقط.
              </h4>
              <br />
              <h4>
                <strong>5- (الظروف القاهرة)</strong>
              </h4>
              <br />
              <h4>
                إذا حصل ظرف استثنائي او قوة قاهرة خارجية عن إرادة الطرف الاول اثناء فترة
                تنفيذ الطرف الاول لالتزاماته العقدية تحول دون التفيذ او تؤخره، كالحروب
                والنزاعات المسلحة، التغير الحاد في اسعار الصرف للدينار العراقي مقابل
                العملات الاجنبية، الكوارث الطبيعية التي تؤدي الى تأخر او فقدان للمواد
                اللازمة للعمل في المشروع او تؤدي الى اضرار بالمشروع، فأنه يتم تعليق
                التزامات الطرفين ويتم حل الموضوع بالشكل التالي:
              </h4>
              <br />
              <h4>
                1- في حالة الحروب والنزاعات يتم تعليق كل من التزامات الطرفين والعمل حتى
                تنتهي فترة النزاع رسمياً وحسب البيانات الرسمية الصادرة عن الدولة او الامم
                المتحدة
              </h4>
              <br />
              <h4>
                2- في حالة الكوارث الطبيعية (اعمال القدر) وبما يضر بمصالح الطرف الاول
                واعماله يتم تطبيق اجراء مشابه للفقرات اعلاه.
              </h4>
              <br />
              <h4>
                3- في حالة اي ظروف قاهرة اخرى يتم التفاوض بين الطرفين للاتفاق على مايلي
              </h4>
              <br />
              <h4>
                1- تحديد مدة الظروف الاستثنائية او القوة القاهرة وحسب البيانات الرسمية
                الصادرة من الدولة.
              </h4>
              <h4>
                2- في حالة استحالة تنفيذ بقية العمل يتم تصفية العقد رضائيا اوحسب القوانين
                النافذه في المحاكم العراقية.
              </h4>
              <h4>3- تحديد مبلغ التعويض عن الاضرار الناجمة عن ذلك لصالح الطرف الاول</h4>
            </div>
          </v-container>
        </v-card>
      </v-card>
      <v-card class="gdd">
        <v-card
          style="
            background-color: rgb(255 255 255 / 85%);
            height: 100%;
            overflow: hidden;
            display: flex;
            flex-direction: column;
            justify-content: space-between;
          "
        >
          <v-container style="text-align: right">
            <div>
              <h4>
                4- تقيم الارض والبناء الذي عليها مع الخدمات المقدمه من قبل المجمع بسعر
                السوق السائد ويتم تسديد بدلها للطرف الاول.
              </h4>
              <br />
              <h4><strong>6- تسوية الخلافات</strong></h4>
              <br />
              <h4>
                أ‌- -في حال تأخر سداد الاقساط عن الفترة الزمنية وفترة السماح المقررة يلجأ
                الطرف الاول بتوجيه انذار اول رسمي صادر من الشركة للطرف الثاني , وفي حال
                عدم تسديد القسط الشهري خلال مدة اسبوع من توجيه الانذار الاول الصادر من
                الشركة , يتم توجيه انذار ثاني عن طريق كاتب عدل الفلوجة بالتسديد بمدة اسبوع
                , وفي حالة عدم التسديد لمدة اسبوع من تاريخ توجية الانذار الثاني الصادر من
                كاتب عدل الفلوجة , يتم رفع دعوه قضائية في محكمة بدائة الفلوجة والمطالبة
                بمبلغ الرهن المتبقي كاقساط شهرية على الوحدة السكنية ,وتعتبر موافقة الطرف
                الثاني على هذه الفقرة بمثابة تعهد منه( الطرف الثاني) باخلاء و تسليم الوحدة
                السكنية الى الطرف الاول لحين البت بالقضية عن طريق المحكمة
              </h4>
              <br />
              <h4>
                ب‌- في حالة حصول خلافات بين الطرفين نتيجة تنفيذ هذا العقد او نتيجة
                للاختلاف في تفسير فقرة من فقراته فانه يتم حلها ودياً، وفي حالة عدم التوصل
                الى حل ودي يتم احالة الخلاف الى لجنة تحكيم متكونة من ممثل للطرف الاول
                وممثل للطرف الثاني ويتم اختيار العضو الثالث بالاتفاق بين الطرفين والذي
                يترأس لجنة التحكيم ...
              </h4>
              <br />
              <h4>
                <strong
                  >، وفي حالة عدم الاتفاق مع العضو الثالث يطلب من المحكمة المختصة تعيين
                  لجنة وتسمى اللجنة هيئة التحكيم ويراعى في ذلك الامور التالية.</strong
                >
              </h4>
              <br />
              <h4>
                1- في حالة عدم توصل هيئة التحكيم الى حل يحال الخلاف الى محكمة بداء الفلوجة
                للبت فيه.
              </h4>
              <br />
              <h4>
                2- تكون قواعد التحكيم الواردة في قانون المرافعات المدنية العراقي هي
                الواجبة التطبيق، ويعتبر المرجع القانوني لاجراءات التحكيم.
              </h4>
              <br />
              <h4>3- تكون قرارات هيئة التحكيم نهائية وملزمة.</h4>
              <br />
              <h4>
                4- لايكون تعامل الطرف الاول مع الطرف الثاني بصيغ إفراد وانما كيان شركة
                قائم متمثلا بوكيل مديرها المفوض حصرا.
              </h4>
              <br />
              <h4>
                5- لاايكون للاعراف العشائرية اي سلطة على العقد او الشركة او مديرها المفوض
                او اي شخص من افرادها والعاملين فيها وتكون السلطة القضائية للقضاء العراقي
                حصرا.
              </h4>
            </div>
          </v-container>
        </v-card>
      </v-card>
      <v-card class="gdd">
        <v-card
          style="
            background-color: rgb(255 255 255 / 85%);
            height: 100%;
            overflow: hidden;
            display: flex;
            flex-direction: column;
            justify-content: space-between;
          "
        >
          <v-container style="text-align: right">
            <div>
              <h4>
                <strong
                  >في حالة الاتفاق على تسوية المنازعات عن طريق الجهات القضائية يتم الاتفاق
                  على الصيغة الآتية:</strong
                >
              </h4>
              <br />
              <h4>
                اتفق الطرفان على انه في حالة حدوث نزاع فيما بين الطرفين بصدد تنفيذ او
                تفسير بند من بنود هذا العقد يتم تسويته ودياً فيما بين الطرفين، وفي حالة
                تعذر ذلك يتم اللجوء الى الجهات والمحاكم المختصة في محكمة بداءة الفلوجة
                للبت فيه.
              </h4>
              <br />
              <h4>
                <strong
                  >وفي حالة الاتفاق على تسوية النزاع بواسطة التحكيم يتم الاتفاق على الصيغة
                  الاتية:</strong
                >
              </h4>
              <br />
              <h4>
                اتفق الطرفان على انه في حالة حدوث نزاع فيما الطرفين بصدد بسبب تنفيذ
                اوتفسير بند من بنود هذا العقد يتم تسويته عن طريق التحكيم وفقاً للنظام
                المذكور اعلاه ويعتبر قرار التحكيم الصادر بتسوية النزاع نهائيا وملزما
                للطرفين ولا يحق لاي منهما الاعتراض باي شكل من الاشكال ويتحمل الطرفان اتعاب
                المحكمة مناصفة.
              </h4>
              <br />
              <h4>
                <strong>7- (الإشعارات والتبليغات)</strong>
              </h4>
              <br />
              <h4>
                كافة الاخطارات والانذارات والاشعارات المنصوص عليها في هذا العقد يجب ان
                تكون عن طريق كاتب عدل الفلوجة ويمكن ارسالها عن طريق البريد الالكتروني مع
                التعزيز بارسال خطاب مسجل او تسلم باليد للطرف المرسل اليها من خلال الهاتف
                او الفايبر او الوتس اب اوالفيس بوك او أحد تابعيه مع اخذ التوقيع بالاستلام
                وذلك على العناوين المبينة في مقدمة هذا العقد.
              </h4>
            </div>
          </v-container>
          <v-container>
            <div>
              <h3>الطرف الثاني: {{ data.owner_name }}</h3>
              <br />
              <br />
              <h3>التوقيع: -</h3>
              <br />
              <br />
              <h3>العنوان /</h3>
            </div>
          </v-container>
        </v-card>
      </v-card>
    </v-container>
  </div>
</template>

<script>
import numberWithComma from "@/constant/number";
import qaiwan from "@/assets/logo/qaiwan.jpg";
import tafqeet from "@/constant/Tafqeet.js";
import ata from "@/assets/logo/ata.png";

export default {
  data() {
    return {
      qaiwan,
      ata,
      data: {},
      user: null,
    };
  },
  created() {
    this.data = JSON.parse(localStorage.getItem("PrintAljanain"));
    this.user = JSON.parse(localStorage.getItem("results"));
  },
  computed: {
    sortedSalaryPayments() {
      const getPaymentWeight = (payment_position) => {
        switch (payment_position) {
          case "مقدم":
            return 1;
          case "دفعة الهيكل":
            return 2;
          default:
            return 3;
        }
      };

      return this.data.salary_payments.slice().sort((a, b) => {
        return (
          getPaymentWeight(a.payment_position) - getPaymentWeight(b.payment_position)
        );
      });
    },
  },

  mounted() {
    setTimeout(() => {
      this.printElement();
    }, 500);
  },
  methods: {
    stringText(item) {
      return tafqeet(item);
    },
    numberWithComma,
    getAdjustedIndex(index) {
      const structurePaymentIndex = this.sortedSalaryPayments.findIndex(
        (payment) => payment.payment_position === "دفعة الهيكل"
      );

      if (structurePaymentIndex === -1 || index <= structurePaymentIndex) {
        return index + 1;
      } else {
        return index - structurePaymentIndex;
      }
    },

    printElement() {
      var printContent = document.getElementById("pri").innerHTML;
      var originalContent = document.body.innerHTML;
      var originalStyle = document.head.innerHTML;

      document.body.innerHTML = printContent;

      window.print();

      document.body.innerHTML = originalContent;
      document.head.innerHTML = originalStyle;

      setTimeout(() => {
        this.printing = false;
      }, 100);
    },
  },
};
</script>

<style>
.v-card {
  margin-bottom: 15px;
  height: auto;
}
h4 {
  color: black;
  font-weight: 400;
}
.gdd {
  border: solid 10px #0169a6;
}
ul {
  color: black;
}
@media print {
  @media print {
    table {
      page-break-inside: auto;
    }

    body {
      direction: rtl;
    }
    #pri v-card-title v-row {
      display: flex;
      align-items: center;
      justify-content: space-around;
      flex-direction: row;
    }
    .gdd {
      margin-bottom: 0px;
      height: 100vh;
      page-break-before: always;
    }
    .gd {
      margin-bottom: 0px;
      height: auto;
      page-break-before: always;
    }
    .dis {
      display: flex !important;
      flex-direction: column !important;
      justify-content: space-between !important;
      height: 100% !important;
    }
    .diss {
      display: flex !important;
      flex-direction: column !important;
      justify-content: space-between !important;
      height: auto !important;
    }
    .gdd:first-child {
      page-break-before: auto;
    }
    table {
      page-break-inside: auto;
    }
    tr {
      page-break-inside: avoid;
      page-break-after: auto;
    }
    td,
    th {
      page-break-inside: avoid;
      page-break-after: auto;
    }
  }
}
</style>
