<template>
  <div>
    <v-container id="pri">
      <v-card
        class="gdd"
        :style="`background-image: url(${ba});background-position: center;background-repeat: no-repeat;background-size: auto;`"
      >
        <v-card
          style="
            background-color: rgb(255 255 255 / 0%);
            height: 100%;
            overflow: hidden;
            display: flex;
            flex-direction: column;
            justify-content: space-between;
          "
        >
          <v-container>
            <br />
            <br />
            <div>
              <h3 style="font-weight: 900; text-align: center">
                عقد بيع شقة سكنية – مشروع مدينة الزائرين (مجمع أبراج العبسلي
                السكني) نظـــــام الاقســــــاط
              </h3>
              <br />
              <h3>رقم العقـد ({{ data.contract_id }})</h3>
              <h3>تاريخــــه {{ data.createdAt }}</h3>
              <br />
              <h3>
                الطرف الاول / البائع شركة بريق العمران للاستثمار و التطوير و
                التسويق العقاري - شركة خاصه
              </h3>
              <br />
              <h3>
                عنوانه بغداد الكاظمية مشروع مدينة الزائرين( مشروع أبراج العبسلي
                السكني)
              </h3>
              <br />
              <h3>
                الطرف الثاني / المشتري / المستفيد : السيد (
                {{ data.owner_name }} )
              </h3>
              <br />
              <h3>
                عنوانه بموجب بطاقة السكن : محلة:
                <span style="margin-inline: 60px"></span> زقاق :
                <span style="margin-inline: 60px"></span> دار :
                <span style="margin-inline: 60px"></span>
              </h3>
              <br />
              <h3>
                مكتب معلومات ( <span style="margin-inline: 60px"></span> ) آخر :
              </h3>
              <br />
              <h3>رقم الهاتف : - {{ data.owner_phone }}</h3>
              <br />
              <h3>رقم الهوية التعريفية : {{ data.owner_id_number }}</h3>
            </div>
          </v-container>
          <v-container>
            <v-row
              style="
                display: flex;
                flex-direction: row;
                justify-content: space-between;
                align-items: center;
              "
            >
              <v-col
                cols="6"
                md="6"
                style="padding: 10px; text-align: right; white-space: pre-wrap"
                >توقيع الطرف الاول
              </v-col>
              <v-col
                cols="6"
                md="6"
                style="padding: 10px; text-align: left; white-space: pre-wrap"
              >
                توقيع الطرف الثاني
              </v-col>
            </v-row>
          </v-container>
        </v-card>
      </v-card>
      <v-card
        class="gdd"
        :style="`background-image: url(${ba});background-position: center;background-repeat: no-repeat;background-size: auto;`"
      >
        <v-card
          style="
            background-color: rgb(255 255 255 / 0%);
            height: 100%;
            overflow: hidden;
            display: flex;
            flex-direction: column;
            justify-content: space-between;
          "
        >
          <v-container>
            <br />
            <br />
            <div>
              <h3 style="font-weight: 900; text-align: center">مقدمـــــة</h3>
              <br />
              <p>
                بما ان الطرف الاول يعمل في مجال الاستثمار و التطويرو التسويق
                العقاري و شركته مسجله لدى مسجل الشركات برقم م.ش.أ /22689002 في
                6/12/2023 و لشراءه مجموعة من الوحدات السكنية في مشروع مدينة
                الزائرين( مشروع ابراج العبسلي الحاصل على ألاجازة الاستثمار
                230-2018 الصادرة من الهيئة الوطنية للاستثمار) بموجب العقد الموقع
                بينهما وقد التزم مالك المشروع بكافة الشروط القانونية الملزم بها
                بموجب قانون الاستثمار تجاه الطرفين و موافقته على العقد و التزامه
                بموجب العقد المذكور بانه مسؤول عن كافة التزامات مالك المشروع
                الواردة في هذا العقد وانه يحفظ حقوق المشترين من الطرف الاول و
                يحفظ حقوق الطرف الاول القانونية و المالية .
              </p>
              <p>
                و لرغبة الطرف الثاني بشراء الواحده السكنية في المشروع و اطلاعه
                على تفاصيل المجمع و بناياته و مساحة الوحدة السكنية و موقعها و
                الخدمات الموجودة في المجمع و اطلاعه على تفاصيلها الفنية في ملاحق
                العقد و مبالغ و مدد تسديد الاقساط و رغبته بالشراء و تملك وحده
                سكنية (قيد الانشاء) في المجمع و لعدم وجود مانع قانوني فقد اتفق
                الطرفان على مايلي:-
              </p>
              <h3 style="font-weight: 900">
                تعتبر مقدمة هذا العقد جزءا لا يتجزأ من هذا العقد.
              </h3>
              <p>
                1. باع الطرف الاول الوحده السكنية قيد الانشاء الى الطرف الثاني
                بموجب الخارطة المعلنة،والمذكورة بياناتها بالجدول وكما يلي:
              </p>
              <br />
              <div style="display: grid; place-items: center">
                <div
                  style="border: solid 2px black; width: 50%; padding: 10px 0px"
                >
                  <p
                    style="
                      border-bottom: solid 1px black;
                      padding-bottom: 10px;
                      padding-right: 12px;
                    "
                  >
                    رقم المرحلة :الثانية
                  </p>
                  <p
                    style="
                      border-bottom: solid 1px black;
                      padding-bottom: 10px;
                      padding-right: 12px;
                    "
                  >
                    رقم البناية: {{ data.exact_apartment_building }}
                  </p>
                  <p
                    style="
                      border-bottom: solid 1px black;
                      padding-bottom: 10px;
                      padding-right: 12px;
                    "
                  >
                    رقم الطابق: {{ data.house_floor_number }}
                  </p>
                  <p
                    style="
                      border-bottom: solid 1px black;
                      padding-bottom: 10px;
                      padding-right: 12px;
                    "
                  >
                    رقم الشقة: {{ data.house_name }}
                  </p>
                  <p
                    style="
                      border-bottom: solid 1px black;
                      padding-bottom: 10px;
                      padding-right: 12px;
                    "
                  >
                    مساحة الشقة الاجمالية: {{ data.house_total_space }}
                  </p>
                  <p style="padding-right: 12px; margin-bottom: 4px">
                    مساحة الشقة الصافية: {{ data.house_building_space }}
                  </p>
                </div>
              </div>
            </div>
          </v-container>
          <v-container>
            <v-row
              style="
                display: flex;
                flex-direction: row;
                justify-content: space-between;
                align-items: center;
              "
            >
              <v-col
                cols="6"
                md="6"
                style="padding: 10px; text-align: right; white-space: pre-wrap"
                >توقيع الطرف الاول
              </v-col>
              <v-col
                cols="6"
                md="6"
                style="padding: 10px; text-align: left; white-space: pre-wrap"
              >
                توقيع الطرف الثاني
              </v-col>
            </v-row>
          </v-container>
        </v-card>
      </v-card>
      <v-card
        class="gdd"
        :style="`background-image: url(${ba});background-position: center;background-repeat: no-repeat;background-size: auto;`"
      >
        <v-card
          style="
            background-color: rgb(255 255 255 / 0%);
            height: 100%;
            overflow: hidden;
            display: flex;
            flex-direction: column;
            justify-content: space-between;
          "
        >
          <v-container>
            <br />
            <br />
            <div>
              <!-- <h3 style="font-weight: 900; text-align: center">مقدمـــــة</h3> -->
              <br />
              <p>
                2. وافق الطرف الثاني على شراء الوحده السكنية المذكورة في
                البند(1)اعلاه بعد اطلاعه على الخارطة المعلنة،ووفق جدول
                الدفعات/الاقساط مرفق رقم (1) واستنادا الى المخططات الهندسية
                المرفقة بهذا العقد/مرفق رقم(2)و المواصفات الخاصة بالوحده السكنية
                عند تسليمها و المبينة في جدول رقم (3) .
              </p>
              <p>
                3. قيمة العقد : اتفق الطرفان بأن تكون قيمة الوحده السكنية
                المذكورة اعلاه ببدل اجمالي وقدره ( {{ numberWithComma(data.salary_amount) }} ) مليون دينار عراقي فقط لاغير،
                تسدد على شكل ({{ data.salary_payment_months_number }}) دفعة وحسب جدول التسديد وتاريخ الاستحقاق
                المرفق رقم (1) .
              </p>
              <p>
                4. يقر الطرف الثاني بأنه قد قام بمعاينة موقع المشروع والارض
                المزمع اقامة المبنى و الوحده السكنية عليها،بالاضافة الى معاينة
                المخططات والتصاميم والمواصفات والاسعار(التي حددها الطرف الاول)
                والية السداد ،و الاطلاع على المساحات المشتركة للوحدات السكنية و
                المساحة الصافية و النهائية للوحدة السكنية و بما ينفي الجهالة
                بصورة تامة مع القبول بوجود احتمال التغيير البسيط في المساحة
                للوحدة السكنية بسبب التصاميم والانشاءات ولا يكون هذا التغير (
                نقصا او زيادة ) سببا مخلا في العقد والتي لا تؤثر على مساحة
                الوحدة السكنية بمنظور عام و سوف يتم اجراء تسوية مالية في حال
                وجود زيادة او نقصان و بما يضمن حقوق الطرف الاخر.
              </p>
              <p>
                5. يلتزم الطرف الثاني بتسديد وايداع قيمة اقساط الوحده السكنية
                اعلاه بتاريخ استحقاقها وكما هو موضح في جدول الدفعات المذكور في
                (الفقرة 3) الى الطرف الاول نقداً.
              </p>
              <h3 style="font-weight: 900">التزامات الطرف الاول:</h3>
              <p>
                6. يلتزم الطرف الاول بالمتابعة مع مالك المشروع لتسليم الوحده
                السكنية بموعدها المحدد بموجب هذا العقد.
              </p>
              <p>
                7. يكون الطرف الاول المسؤول عن تحديد سعر البيع في هذا العقد.
              </p>
              <p>
                8. يلتزم الطرف الاول بالمتابعة مع الطرف الثاني لغرض استلام
                الاقساط المستحقة و حسب مواعيد استحقاقها.
              </p>
              <h3 style="font-weight: 900">التزامات مالك المشروع:</h3>
              <p>
                9. يسلم مالك المشروع للطرف الثاني الوحده السكنية المشار اليها في
                البند(١) من هذا العقد بعد 30 شهرآ "( ثلاثون شهرآ")تبدأ من تاريخ
                1/12/ 2023 وهو تاريخ البدء بعملية التسويق للوحدات السكنية في
                المشروع للمرحلة الثانية .
              </p>
              <p>
                10. يلتزم مالك المشروع بإنجاز اعمال شبكات البنى التحتية وإقامة
                الشوارع والارصفة داخل المشروع السكني وعلى عدة مراحل.
              </p>
              <p>
                11.	يلتزم مالك المشروع بتسجيل مساحة الوحده السكنية الصافية المذكورة في البند(١)اعلاه،بأسم الطرف الثاني في دائرة التسجيل العقاري المختصة ، وبموجب التعليمات والقوانين النافذة،وبعد قيام الطرف الثاني بتسديد كامل قيمة الوحده السكنية للطرف الاول ،كما ويخضع هذا العقد لاحكام 
              </p>
            </div>
          </v-container>
          <v-container>
            <v-row
              style="
                display: flex;
                flex-direction: row;
                justify-content: space-between;
                align-items: center;
              "
            >
              <v-col
                cols="6"
                md="6"
                style="padding: 10px; text-align: right; white-space: pre-wrap"
                >توقيع الطرف الاول
              </v-col>
              <v-col
                cols="6"
                md="6"
                style="padding: 10px; text-align: left; white-space: pre-wrap"
              >
                توقيع الطرف الثاني
              </v-col>
            </v-row>
          </v-container>
        </v-card>
      </v-card>
      <v-card
        class="gdd"
        :style="`background-image: url(${ba});background-position: center;background-repeat: no-repeat;background-size: auto;`"
      >
        <v-card
          style="
            background-color: rgb(255 255 255 / 0%);
            height: 100%;
            overflow: hidden;
            display: flex;
            flex-direction: column;
            justify-content: space-between;
          "
        >
          <v-container>
            <br />
            <br />
            <div>
              <!-- <h3 style="font-weight: 900; text-align: center">مقدمـــــة</h3> -->
              <br />
              <p>
                قانون تنظيم ملكية الطوابق و الشقق في العمارات،التشريع رقم (61) لسنة (2001) ، في كل ما يتعلق بالملكية والسكن في هذه الوحده السكنية. 
              </p>
              <p>
                12.	التزام مالك المشروع بالتعاقد مع شركات مختصة بتوفير الخدمات العامة التي ستحتاجها الوحدات السكنية في المشروع، ويلتزم الطرف الثاني بتسديد قيمة بدل الخدمات الشهرية وفقآ للتسعيرة البالغة  ما يعادل (1000) الف دينار لكل متر مربع للمساحة الاجمالية من للوحده السكنية وقابلة للتغيير وفي حالة عدم التزام الطرف بالثاني بدفع ما عليه من المستحقات المالية لتلك الشركات لمدة شهرين لقاء الخدمات المقدمة اليهم يتم حرمان الطرف الثاني من تلك الخدمات واخطارهم باسباب القطع، والمشتملة على ما يلي :
              <ul style="list-style-type: none;margin-right: 15px;margin-top: 10px;">
                <li>‌أ.	خدمة استعلامات لمدخل المشروع وادارة عملية دخول وخروج السيارات.</li>
                <li>‌ب.	جمع ورفع النفايات من الحاويات الخارجية للعمارة السكنية.</li>
                <li>‌ج.	خدمة تنظيف الشوارع الداخلية والارصفة للمجمع السكني.</li>
                <li>‌د.	سقي وادامة وتنظيف الحدائق الخارجية للمجمع السكني.</li>
                <li>‌ه.	صيانة المصاعد.</li>
                <li>‌و.	تنظيف الممرات والسلالم داخل العمارة.</li>
                <li>‌ز.	خدمة المراقبة الأمنية و سلامة امن المجمع.</li>
              </ul>
              </p>
              <h3 style="font-weight: 900;">التزامات الطرف الثاني:</h3>
              <p>
                13.	يلتزم الطرف الثاني باحكام قانون الاستثمار و الأنظمة و التعليمات الصادرة بموجبه فيما يخص تحويل ملكية الوحدات السكنية من المستثمر الى المشترين للوحدات السكنية والتوقيتات المحددة بموجب هذا القانون و اية قوانين أخرى ذات علاقة بتسجيل ملكية الوحدات السكنية .
              </p>
              <p>
                14.	يتحمل الطرف الثاني كافة الرسوم التي تقتضيها قانونا عملية التسجيل وفق احكام قانون التسجيل العقاري رقم(43)لسنة (1971)المعدل ،بالاضافة الى اية مصاريف او ضرائب او عمولات اخرى، كما يلتزم بتقديم كافة المستمسكات و الوثائق اللازمة لاكمال عملية التسجيل لاول مرة.
              </p>
              <p>
                15.	يلتزم الطرف الثاني باستلام الوحدة السكنية في الموعد الذي يحدده الطرفان الاول و مالك المشروع عند اكتمالها و حسب المتغيرات و الاحداث للتوقيتات التي بينها مالك المشروع ابتداءا ،و يعتبر الطرف الثاني مبلغا بالاستلام على وفق العناوين التي اقر بها لغرض تبليغه و يعتبر مستلم للوحده السكنية حكما و مستحقا لدفع القسط النهائي للاستلام و تمضي بحقه المدد المبينة في العقد الخاصة بالاستلام و الفحص و الضمان و الغرامات التاخيرية .
              </p>
            </div>
          </v-container>
          <v-container>
            <v-row
              style="
                display: flex;
                flex-direction: row;
                justify-content: space-between;
                align-items: center;
              "
            >
              <v-col
                cols="6"
                md="6"
                style="padding: 10px; text-align: right; white-space: pre-wrap"
                >توقيع الطرف الاول
              </v-col>
              <v-col
                cols="6"
                md="6"
                style="padding: 10px; text-align: left; white-space: pre-wrap"
              >
                توقيع الطرف الثاني
              </v-col>
            </v-row>
          </v-container>
        </v-card>
      </v-card>
      <v-card
        class="gdd"
        :style="`background-image: url(${ba});background-position: center;background-repeat: no-repeat;background-size: auto;`"
      >
        <v-card
          style="
            background-color: rgb(255 255 255 / 0%);
            height: 100%;
            overflow: hidden;
            display: flex;
            flex-direction: column;
            justify-content: space-between;
          "
        >
          <v-container>
            <br />
            <br />
            <div>
              <!-- <h3 style="font-weight: 900; text-align: center">مقدمـــــة</h3> -->
              <br />
              <p>
                16.	لا يحق للطرف الثاني التصرف بالوحده السكنية موضوع هذا العقد او رهنها او بيعها او التنازل و الهبة عنها او التحويل للغير كلا"او جزءا"الا بعد قيامه بتسديد ما لا يقل عن 25%من قيمة الوحدة السكنية و بعد مرور مدة لا تقل عن 30 يوما من توقيع العقد واستحصال موافقة الطرفان الاول و مالك المشروع الخطية على التحويل،كما ويلتزم الطرف الثاني بتسديد عمولة مقدارها 3٪ عن عملية البيع من سعر للوحده السكنية الإجمالي المذكور في هذا العقد و تدفع مناصفة بين الطرف الثاني و المشتري الجديد  الى مالك المشروع ،لتغطية المصاريف الادارية لإعادة تحرير عقود البيع ، ويعد اي اتفاق خارج معرفة ودراية وعلم الطرفان الاول و مالك المشروع باطلآ ولا يعتد به قانونآ ويعتبر مخالفآ لشروط هذا العقد .
              </p>
              <!-- <h3 style="font-weight: 900;">التزامات الطرف الثاني:</h3> -->
              <p>
                17.	يلتزم الطرف الثاني باحكام المادة (8) من قانون تنظيم ملكية الطوابق و الشقق رقم (61) لسنة 2001  بعدم القيام بأية اعمال من شانها تعديل التصميم الانشائي للوحده السكنية او الاضافة على عدد الغرف او القيام بأي اعمال تكسير او بناء او انشاء او توسعة للغرفة او تركيب وحدات تكييف او مبردات او عمل فتحات او عمل يجعل من للوحده السكنية مخالفة لمثيلاتها في المشروع، بأي حال من الاحوال وتعتبر مساحة البناء التي سيقوم  مالك المشروع بأنشائها وتطويرها نهائية وغير قابلة للاضافة، كما ويلتزم الطرف الثاني بعدم بناء او حجز اي من الاماكن العامة داخل المشروع، وبخلافة يتحمل الطرف الثاني كامل المسؤولية القانونية والمالية الناتجة عن الضرر الحاصل بالاضافة الى تحمل الطرف الثاني كلفة ازالة الضرر الحاصل او اصلاحة خلال مدة لا تتجاوز(3) أيام  وعلى حسابه الخاص من تاريخ اخطاره خطيآ،من قبل مالك المشروع كما ويحق لمالك المشروع تغريمه بالبدل الذي يراه مناسبآ وبأتخاذ ايه اجراءات ادارية او قانونية يراها ملزمة ومناسبة للطرف الثاني و اعادة الشقة الى وضعها الاصلي وتعتبر المخططات الهندسية المصادقة هي المقياس لبيان التغيير من عدمه، وفي حال امتناع الطرف الثاني يحق للطرف مالك المشروع فسخ هذا العقد.
              </p>
              <p>
                18.	يلتزم الطرف الثاني قبل  دفعه دفعة الاستلام الخاصة بالوحده السكنية و قبل استلامه لها   بالتأمين عليها مباشرة بوثيقة تامين سنوية ضد الحريق والهدم الكلي والجزئي لدى شركة التامين المعتمدة من مالك المشروع و التي ستقوم بتامين البناية كاملة،وتزويد مالك المشروع بنسخة من وثيقة التامين ، وبخلافه سوف يقوم مالك المشروع بالتأمين على الوحده السكنية واستحصال  قيمة رسم التأمين من الطرف الثاني  قبل تسليم مفاتيح الوحده السكنية .
              </p>
              <p>
                19.	بموجب توقيعه لهذا العقد يلتزم ويتعهد الطرف الثاني وخلفه العام والخاص بأن الوحده السكنية محل هذا العقد سوف تستخدم لغرض السكن فقط ولا يحق له تغيير الغرض المخصص لها او استعمال الشقة لأي غرض اداري او صناعي او ديني او تعليمي او مهني او وضع إعلانات او منشورات وملصقات خارج الشقة او اي استخدامات اخرى تكون مخالفة لغير الغرض المتفق عليه في هذا العقد، وبخلافه يحق لمالك المشروع  تغريمه حسب ما يراه مناسب والعمل على ملاحقته قضائيآ للضرر الحاصل جراء اساءة استخدام الشقة السكنية ، وتكون تكلفة الازالة واعادة الحال الى ما كان عليه على نفقة الطرف الثاني بالكامل.
              </p>
            </div>
          </v-container>
          <v-container>
            <v-row
              style="
                display: flex;
                flex-direction: row;
                justify-content: space-between;
                align-items: center;
              "
            >
              <v-col
                cols="6"
                md="6"
                style="padding: 10px; text-align: right; white-space: pre-wrap"
                >توقيع الطرف الاول
              </v-col>
              <v-col
                cols="6"
                md="6"
                style="padding: 10px; text-align: left; white-space: pre-wrap"
              >
                توقيع الطرف الثاني
              </v-col>
            </v-row>
          </v-container>
        </v-card>
      </v-card>
      <v-card
        class="gdd"
        :style="`background-image: url(${ba});background-position: center;background-repeat: no-repeat;background-size: auto;`"
      >
        <v-card
          style="
            background-color: rgb(255 255 255 / 0%);
            height: 100%;
            overflow: hidden;
            display: flex;
            flex-direction: column;
            justify-content: space-between;
          "
        >
          <v-container>
            <br />
            <br />
            <div>
              <!-- <h3 style="font-weight: 900; text-align: center">مقدمـــــة</h3> -->
              <br />
              <p>
                20.	 يتعهد ويلتزم الطرف الثاني بأن يكون مسؤولآ عن سداد بدل الخدمات لشركة الخدمات المرشحة من قبل مالك المشروع لادارة شؤون النظافة و الكهرباء الاحتياطية ( المولدات و الانترنت )، وكافة المصروفات والخدمات الحكومية من فواتير المياه والكهرباء واي توصيلات للوحده السكنية واية ضرائب محلية او عقارية ..الخ، اعتبارآ من تاريخ استلامه للوحده السكنية او من تاريخ اعلان مالك المشروع عن موعد التسليم وجهوزية الوحدات للسكن ايهما اولآ، وفي حال تخلف الطرف الثاني او امتناعه فيحق لمالك المشروع قطع الخدمات عنه ودون اي اعتراض من الطرف الثاني وحتى قيامه بالسداد التام لقيمة بدلات الخدمات المستحقة عن وحدته السكنية .
              </p>
              <p>
                21.	يحق للطرف الثاني اجراء فحص استلام للوحدات السكنية مع مالك المشروع او من يمثله وتوقيع قائمة حصرية بأية ملاحظات فنية ويكون على مالك المشروع اصلاح تلك الملاحظات خلال فترة زمنية مناسبة ولا يحق للطرف الثاني تعليق او حجب قيمة القسط المستحق او جزء منه بسبب ذلك في حال ظهور اي خلاف يخص الملاحظات فيكون قرار اصلاحه هو من اختصاص مهندس مالك المشروع حصرآ ويكون قراره نهائي وملزم للطرف الثاني .
              </p>
              <p>
                22.	يلتزم الطرف الثاني بعدم الدخول الى مكان العمل اثناء تنفيذ الاعمال الانشائية في موقع المشروع بدون موافقة كتابية من مالك المشروع، ويتحمل الطرف الثاني وحده كامل المسؤولية عن سلامته الشخصية في حال وقوع اي اصابات له او لمن يرافقه من افراد ولا يحق له العودة على مالك المشروع بتعويض اي سبب من الاسباب جراء السماح له بالدخول، كما ولا يحق للطرف الثاني التدخل في شؤون البناء او في عمل الكادر الهندسي والإداري.              
              </p>
              <p>
                23.	يلتزم الطرف الثاني باستخدام المقاييس و المنافذ التي سيقوم بنصبها مالك المشروع ضمن الوحده السكنية لغرض قياس تجهيز خدمات ( الماء و الكهرباء و الغاز ) و عدم التلاعب بها او تجاوزها واستخدام منافذ أخرى او المنافذ المخصصة للاستخدام العام في المناطق المشتركة و يتحمل الطرف الثاني المسؤولية القانونية الكاملة امام الجهات الحكومية المزودة لهذه الخدمات عند مخالفته لهذا البند.
              </p>
              <h3 style="font-weight: 900;">القوة القاهرة:</h3>
              <p>
                24.	لا يتحمل الطرف الاول و مالك المشروع اي مسؤولية عن تأخير تسليم الوحده السكنية الى الطرف الثاني في حالة تعرض المشروع الى ظروف القوة القاهرة او اعمال الحرب او الاعمال الارهابية او العدوان الخارجي او الفيضانات او الزلازل او الكوارث الطبيعية و الاجراءات القضائية او الادارية او انسداد طرق دخول المواد الانشائية او منع للتجوال او اي مانع امني(لا سامح الله)،ولا يحق للطرف الثاني مطالبة الطرف الاول و مالك المشروع بتسديد اية تعويضات مالية وقانونية او اعادة اية مبالغ مسددة عن الوحده السكنية.
              </p>
            </div>
          </v-container>
          <v-container>
            <v-row
              style="
                display: flex;
                flex-direction: row;
                justify-content: space-between;
                align-items: center;
              "
            >
              <v-col
                cols="6"
                md="6"
                style="padding: 10px; text-align: right; white-space: pre-wrap"
                >توقيع الطرف الاول
              </v-col>
              <v-col
                cols="6"
                md="6"
                style="padding: 10px; text-align: left; white-space: pre-wrap"
              >
                توقيع الطرف الثاني
              </v-col>
            </v-row>
          </v-container>
        </v-card>
      </v-card>
      <v-card
        class="gdd"
        :style="`background-image: url(${ba});background-position: center;background-repeat: no-repeat;background-size: auto;`"
      >
        <v-card
          style="
            background-color: rgb(255 255 255 / 0%);
            height: 100%;
            overflow: hidden;
            display: flex;
            flex-direction: column;
            justify-content: space-between;
          "
        >
          <v-container>
            <br />
            <br />
            <div>
              <h3 style="font-weight: 900;">احكام عامة:</h3>
              <br />
              <p>
                25.	في حال تأخر او نكول او اخلال او عدول او تلكؤ او امتناع او تعمد او تراجع الطرف الثاني ولاي سبب من الاسباب عن تسديد الدفعات او الدفعة النهائية والايفاء بالالتزامات المالية المستحقة عن الوحده السكنية ووفق المدة الزمنية المحددة لكل قسط والموضحة في جدول الدفعات/الاقساط المرفق بهذا العقد/مرفق رقم( 1 )،فسيتم بعد مرور مدة ١٥ يوم من تاريخ الاستحقاق للدفعة او الدفعة النهائية توجيه انذار أولي من قبل الطرف الاول او مالك المشروع بضرورة الالتزام بالتسديد خلال (7 أيام) ، ومن ثم انذارنهائي مدته (7) أيام  ودون التأثير على الاقساط اللاحقة،فأن لم يلتزم الطرف الثاني بالتسديد،يحق للطرفان الاول و مالك المشروع او اي منهما فسخ هذا العقد واعادة الحال لما كان عليه،ويعتبر هذا العقد مفسوخ من تلقاء نفسه استنادا  الى احكام المادة178 من القانون المدني العراقي رقم40  لسنة1951 ودون الحاجة الى توجيه اخطار او حكم قضائي بذلك، و به يحق للطرفان الاول او مالك المشروع او اي منهما اتخاذ كافة الإجراءات القانونية التي تكفل لهما التعويض عما فاتهما من كسب وما لحقهما من خسارة و اية إجراءات قانونية أخرى.
              </p>
              <p>
                26.	إضافة لما ورد في البند اعلاه فانه في حالة عدم امتثال الطرف الثاني للإنذار النهائي  واعتبار هذا العقد باطلا  فانه يحق للطرف الاول اومالك المشروع او اي منهما التصرف بالوحدة السكنية موضوع العقد وبيعها بسعر السوق السائد في حينه  و يتم استقطاع نسبة تعادل مبلغ الدفعة الأولى من سعر الوحده السكنية و يعاد المبلغ المتبقي من سعر البيع الى  الطرف الثاني .
              </p>
              <p>
                27.	في حال وفاة الطرف الثاني لا سامح الله ، فيحل ورثته بموجب القسام الشرعي محله بالايفاء  بجميع الالتزامات المذكورة بهذا العقد وتنقل الالتزامات المذكورة بهذا العقد من المورث الى الورثة باعتبارهم الخلف القانوني له و تسري بحقهم كافة الاحكام الخاصة بهذا العقد. 
              </p>
              <p>
                28.	يقوم مالك المشروع  بتقديم فترة صيانة قدرها(سنة واحدة فقط) مجانآ عن ضمان عيوب التنفيذ حصرا تبدأ من تاريخ اعلان مالك المشروع عن موعد التسليم وجهوزية الوحدات للسكن ،وتسري مدة سنة الصيانة حتى وان تعذر  حضور الطرف الثاني لاستلام الوحده السكنية اعتبارآ من تاريخ الاعلان الذي حدده مالك المشروع كموعد تسليم لوحدات المشروع،ولا يتحمل مالك المشروع صيانة ايه عيوب تظهر جراء سوء الاستخدام من قبل الطرف الثاني.   
              </p>
              <!-- <h3 style="font-weight: 900;">القوة القاهرة:</h3> -->
              <p>
                29.	يلتزم الطرف الثاني باستلام الوحده السكنية عند اكمالها في الموعد الذي يحدده مالك المشروع ، وفي حال  عدم حضوره بالموعد المعلن والمحدد للاستلام وخلال 15 يوما خمسة عشرة يوما  كحد اقصى،جاز لمالك المشروع اعتبار الطرف الثاني مستلمآ حكمآ للوحده السكنية كاملة وسليمة و مطابقة للمواصفات المتفق عليها، ويعتبر ذلك ايفاء من مالك المشروع بالتزاماته 
              </p>
            </div>
          </v-container>
          <v-container>
            <v-row
              style="
                display: flex;
                flex-direction: row;
                justify-content: space-between;
                align-items: center;
              "
            >
              <v-col
                cols="6"
                md="6"
                style="padding: 10px; text-align: right; white-space: pre-wrap"
                >توقيع الطرف الاول
              </v-col>
              <v-col
                cols="6"
                md="6"
                style="padding: 10px; text-align: left; white-space: pre-wrap"
              >
                توقيع الطرف الثاني
              </v-col>
            </v-row>
          </v-container>
        </v-card>
      </v-card>
      <v-card
        class="gdd"
        :style="`background-image: url(${ba});background-position: center;background-repeat: no-repeat;background-size: auto;`"
      >
        <v-card
          style="
            background-color: rgb(255 255 255 / 0%);
            height: 100%;
            overflow: hidden;
            display: flex;
            flex-direction: column;
            justify-content: space-between;
          "
        >
          <v-container>
            <br />
            <br />
            <div>
              <!-- <h3 style="font-weight: 900;">احكام عامة:</h3> -->
              <p>
                ،وتبدأ مع هذا التاريخ  سنة الصيانة  المبينة في الفقرة (28) من هذا العقد، ويعتبر الطرف الثاني مسؤولآ عن الوحده السكنية مسؤولية كاملة دون اية مسؤولية على مالك المشروع.
              </p>
              <p>
                30.	في حالة قيام مالك المشروع بانجاز اعماله واكمال انشاء الوحده السكنية وعند تسليم المفتاح قبل الوقت المحدد من قبل المستثمر يجب على الطرف الثاني دفع المبالغ المتبقية من ثمن اجمالي الوحده السكنية خلال مدة اقصاها ثلاثون يوم من تبليغه بالاستلام .وبخلافه يعتبر الطرف الثاني ناكلاً ويطبق بحقة الفقرة (25) من هذا العقد.
              </p>
              <p>
                31.	يلتزم الطرف الثاني بدفع التكلفة التي تتكبدها ادارة المشروع عن الاضرار التي يتسبب بها هو او الساكنين معه او ضيوفه تجاه الممتلكات العامة داخل المشروع .
              </p>
              <p>
                32.	يلتزم مالك المشروع بانشاء مكان لوقوف ومبيت السيارات الخاصة بساكني المجمع ويتم تخصيص مكان لركن ومبيت لسيارة واحدة فقط لكل وحده سكنية واحدة مجانا , وفي حالة حاجة الطرف الثاني الى مكان اضافي عليه بمراجعة ادارة المجمع السكني لغرض توفير مكان اضافي لقاء اشتراك شهري يحدد من قبل مالك المشروع وحسب المتوفر دون الالتزام بمكان معين.  
              </p>
              <p>
                33.	يلتزم الطرف الثاني بالمحافظة على نظافة الوحدات السكنية والمشروع السكني وعدم رمي النفايات في غير الاماكن المخصصة لها، كما ولا يجوز للطرف الثاني نصب ايه (صحون استقبال للستالايت او الانترنت) او ايه توصيلات في الشقة مطلقآ، او استخدام الشرفة لخزن الاثاث او المعدات والمواد القابلة للاشتعال او اغراض شوي الطعام وغيرها او التغيير بالشكل العمراني للبناية من خلال تغيير شكل الشرفة او إضافة الزجاج و ملحقاته مما يسبب تشويها للمنظر الهندسي و الجمالي للبناية، وبخلافه سيعرض نفسه للمساءلة القانونية وللغرامات التي يراها مالك المشروع مناسبة وازالة الضرر.
              </p>
              <!-- <h3 style="font-weight: 900;">القوة القاهرة:</h3> -->
              <p>
                34.	يقوم مالك المشروع بتوفير مولدات الطاقة الكهربائية بسعات تتناسب وحجم المشروع السكني لدعم التيار الكهربائي الوطني تعمل بنظام الساعات لسد النقص الحاصل في تزويد الطاقة الكهربائية بنظام تشغيل (24/24 ) ساعة يوميا ويتم احتساب قيمة وحدة قياس الطاقة الكهربائية الواحدة وفق الأسعار السائدة في السوق تدفع من قبل السكان المشتركين .
              </p>
              <p>
                35.	يلتزم الطرف الثاني بالمحافظة على النظام والاداب العامة والهدوء والسكينة وعدم اثارة الضجيج و الضوضاء في المبنى السكني والابقاء على خلو المرافق العامة والمساحات المشتركة والممرات بين الوحدات من اية عوارض او قطع الاثاث او اغراض او العاب و عدم تخريب الممتلكات العامة والخاصة.؟..الخ، او الاتيان بأي عمل من شأنه الاضرار بالبيئة وتشويه المنظر ،او حيازة الأسلحة من قبله او من قبل زائريه بدون ترخيص قانوني داخل المجمع من دون اطلاع إدارة المجمع عليها او المجاهرة بحمل الأسلحة بشكل قد يؤدي الي 
              </p>
            </div>
          </v-container>
          <v-container>
            <v-row
              style="
                display: flex;
                flex-direction: row;
                justify-content: space-between;
                align-items: center;
              "
            >
              <v-col
                cols="6"
                md="6"
                style="padding: 10px; text-align: right; white-space: pre-wrap"
                >توقيع الطرف الاول
              </v-col>
              <v-col
                cols="6"
                md="6"
                style="padding: 10px; text-align: left; white-space: pre-wrap"
              >
                توقيع الطرف الثاني
              </v-col>
            </v-row>
          </v-container>
        </v-card>
      </v-card>
      <v-card
        class="gdd"
        :style="`background-image: url(${ba});background-position: center;background-repeat: no-repeat;background-size: auto;`"
      >
        <v-card
          style="
            background-color: rgb(255 255 255 / 0%);
            height: 100%;
            overflow: hidden;
            display: flex;
            flex-direction: column;
            justify-content: space-between;
          "
        >
          <v-container>
            <br />
            <br />
            <div>
              <p>
                التأثير على السلم المجتمعي داخل المجمع و التأثير على بقية الساكنين كما ويمنع منعآ باتآ التدخين في  اللوبي والممرات والمصاعد والسلالم داخل المبنى ،لما لها من تأثير سلبي على حساسات اجهزة استشعار الحريق، وفي حال عدم التزام الطرف الثاني فسيصار الى تغريمه بقيمه الضرر الذي يحدده مالك المشروع ودون اي اعتراض من الطرف الثاني .
              </p>
              <p>
                36.	لا يعد اي تنازل او تساهل من قبل مالك المشروع فيما يخص مدة السداد او فيما يتعلق بشروط واحكام هذا العقد تنازلآ عن حقوقة المذكورة في هذا العقد. 
              </p>
              <p>
                37.	اي تغيير لبنود هذا العقد لا يصبح ساريآ الا اذا تم الاتفاق عليه خطيآ بين الاطراف.
              </p>
              <p>
                38.	يعتبر هذا العقد نافذاً بحق الطرفان (الاول و الثاني) و مالك المشروع بكافة ماورد فيه من بنود و يلتزم به التزاماً كاملاً.
              </p>
              <h3 style="font-weight: 900;">القانون الواجب التطبيق:</h3>
              <p>
                39.	في حال نشوب خلاف بين الاطراف فيحق لهم للجوء للحلول الودية في حال رغبة الاطراف لذلك، وفي حال عدم قبولهم بمضمون الحل الودي ، فيتم اللجوء الى القضاء والمحاكم المختصة لتكون هي جهة فض النزاعات و تكون محكمة البداءة في الكاظمية هي المختصة بالنظر في اية منازعات تنشأ عن تفسير او تطبيق احكام هذا العقد.
              </p>
              <h3 style="font-weight: 900;">التبليغات:</h3>
              <p>
                40.	 تعتبر العناوين المذكورة في العقد هي العناوين الرسمية في المخاطبات والرسائل والانذارات والتبليغات، وفي حال قيام احد الاطراف بتغيير عنوانه يلتزم باشعار الطرفين الاخرين خلال مدة 7 ايام من تاريخ تغيير العنوان.
              </p>
              <p>
                41.	يضم هذا العقد المرفقات التالية:
              <ul style="list-style-type: none;margin-right: 15px;margin-top: 10px;">
                    <li>أ‌-	مرفق رقم ( 1) جدول الدفعات والاقساط. </li>
                    <li>ب‌-	مرفق رقم (2) المخططات الهندسية للوحدات السكنية.</li>
                    <li>ت‌-	مرفق  رقم (3) المواصفات الفنية الخاصة بالوحده السكنية عند الاستلام.</li>
                    <li>ث‌-	مرفق رقم (4) صورة من مخطط المشروع الرئيسي الذي يبين موقع الوحده السكنية.</li>
                </ul>
              </p>
            </div>
          </v-container>
          <v-container>
            <v-row
              style="
                display: flex;
                flex-direction: row;
                justify-content: space-between;
                align-items: center;
              "
            >
              <v-col
                cols="6"
                md="6"
                style="padding: 10px; text-align: right; white-space: pre-wrap"
                >توقيع الطرف الاول
              </v-col>
              <v-col
                cols="6"
                md="6"
                style="padding: 10px; text-align: left; white-space: pre-wrap"
              >
                توقيع الطرف الثاني
              </v-col>
            </v-row>
          </v-container>
        </v-card>
      </v-card>
      <v-card
        class="gdd"
        :style="`background-image: url(${ba});background-position: center;background-repeat: no-repeat;background-size: auto;`"
      >
        <v-card
          style="
            background-color: rgb(255 255 255 / 0%);
            height: 100%;
            overflow: hidden;
            display: flex;
            flex-direction: column;
            justify-content: space-between;
          "
        >
          <v-container>
            <br />
            <br />
            <div>
              <br />
              <p>
                كتب هذا العقد في محافظة بغداد وحرر من نسختين وقعت من الاطراف او وكلائهم بتاريخه، يحتفظ الطرف الاول بنسخة اصلية منها و يحتفظ الطرف الثاني بنسخة اصلية، وعليه اقر الاطراف بشروط العقد وبه تم التوقيع بتاريخ :              </p>
              <v-row>
                <v-col cols="6" md="6">
                    <div style="border: solid 1px black;background: white;">
                        <div style="text-align: center;padding-block: 4px;border-bottom: solid 1px black;background: #d9d9d9;">
                            <p style="margin: 0px;">
                                الطرف الثاني / المشتري
                            </p>
                        </div>
                        <div>
                            <v-row style="width: 100%;margin: 0px;border-bottom: solid 1px black;">
                                <v-col cols="3" md="3" style="border-left: solid 1px black;background: #d9d9d9;padding: 0px;">الاسم الرباعـي </v-col>
                                <v-col cols="9" md="9">{{ data.owner_name }}</v-col>
                            </v-row>
                            <v-row style="width: 100%;margin: 0px;border-bottom: solid 1px black;">
                                <v-col cols="3" md="3" style="border-left: solid 1px black;background: #d9d9d9;padding: 0px;">رقم الهاتف </v-col>
                                <v-col cols="9" md="9">{{ data.owner_phone }}</v-col>
                            </v-row>
                            <v-row style="width: 100%;margin: 0px;border-bottom: solid 1px black;">
                                <v-col cols="3" md="3" style="border-left: solid 1px black;background: #d9d9d9;padding: 0px;">رقم الهاتف البديل </v-col>
                                <v-col cols="9" md="9"></v-col>
                            </v-row>
                            <v-row style="width: 100%;margin: 0px;border-bottom: solid 1px black;">
                                <v-col cols="3" md="3" style="border-left: solid 1px black;display: grid;place-items: center;background: #d9d9d9;padding: 0px;">العنوان</v-col>
                                <v-col cols="9" md="9" style="padding: 0px;">
                                    <v-row style="border-bottom: solid 1px black;width: 100%;margin: 0px;">
                                        <v-col cols="3" md="3" style="border-left: solid 1px black;background: #d9d9d9;padding: 0px;text-align: center;">محافظة </v-col>
                                        <v-col cols="3" md="3" style="border-left: solid 1px black;padding: 0px;"></v-col>
                                        <v-col cols="3" md="3" style="border-left: solid 1px black;background: #d9d9d9;padding: 0px;text-align: center;">شارع</v-col>
                                        <v-col cols="3" md="3" style="padding: 0px;"></v-col>
                                    </v-row>
                                    <v-row style="width: 100%;margin: 0px;">
                                        <v-col cols="3" md="3" style="border-left: solid 1px black;background: #d9d9d9;padding: 0px;">القضاء </v-col>
                                        <v-col cols="3" md="3" style="border-left: solid 1px black;"></v-col>
                                        <v-col cols="3" md="3" style="border-left: solid 1px black;"></v-col>
                                        <v-col cols="3" md="3" style="border-left: solid 1px black;"></v-col>
                                    </v-row>
                                </v-col>
                            </v-row>
                            <v-row style="width: 100%;margin: 0px;border-bottom: solid 1px black;">
                                <v-col cols="2" md="2" style="border-left: solid 1px black;background: #d9d9d9;padding: 0px;text-align: center;">محلة</v-col>
                                <v-col cols="2" md="2" style="border-left: solid 1px black;background: #d9d9d9;padding: 0px;"></v-col>
                                <v-col cols="2" md="2" style="border-left: solid 1px black;background: #d9d9d9;padding: 0px;text-align: center;">زقاق</v-col>
                                <v-col cols="2" md="2" style="border-left: solid 1px black;padding: 0px;"></v-col>
                                <v-col cols="2" md="2" style="border-left: solid 1px black;background: #d9d9d9;padding: 0px;text-align: center;">دار</v-col>
                                <v-col cols="2" md="2" style="border-left: solid 1px black;padding: 0px;"></v-col>
                            </v-row>
                            <v-row style="width: 100%;margin: 0px;border-bottom: solid 1px black;height: 190px;">
                                <v-col cols="3" md="3" style="border-left: solid 1px black;background: #d9d9d9;text-align: center;">توقيع</v-col>
                                <v-col cols="3" md="3" style="border-left: solid 1px black;padding: 0px;"></v-col>
                                <v-col cols="3" md="3" style="border-left: solid 1px black;background: #d9d9d9;text-align: center;">بصمة الابهام الايسر</v-col>
                                <v-col cols="3" md="3"></v-col>
                            </v-row>
                        </div>
                    </div>
                </v-col>
                <v-col cols="6" md="6">
                    <div style="border: solid 1px black;background: white;">
                        <div style="text-align: center;padding-block: 4px;border-bottom: solid 1px black;background: #d9d9d9;">
                            <p style="margin: 0px;">
                                الطرف الاول / شركة بريق العمرن للاستثمار و التسويق و التطوير العقاري
                            </p>
                        </div>
                        <div>
                            <v-row style="width: 100%;margin: 0px;border-bottom: solid 1px black;">
                                <v-col cols="3" md="3" style="border-left: solid 1px black;background: #d9d9d9;padding: 0px;">الاسم الرباعـي </v-col>
                                <v-col cols="9" md="9"></v-col>
                            </v-row>
                            <v-row style="width: 100%;margin: 0px;border-bottom: solid 1px black;">
                                <v-col cols="3" md="3" style="border-left: solid 1px black;background: #d9d9d9;padding: 0px;">رقم الهاتف </v-col>
                                <v-col cols="9" md="9" style="padding: 0px;">07844455538</v-col>
                            </v-row>
                            <v-row style="width: 100%;margin: 0px;border-bottom: solid 1px black;">
                                <v-col cols="3" md="3" style="border-left: solid 1px black;display: grid;place-items: center;background: #d9d9d9;padding: 0px;">العنوان</v-col>
                                <v-col cols="9" md="9" style="padding: 0px;">
                                    <v-row style="border-bottom: solid 1px black;width: 100%;margin: 0px;">
                                        <v-col cols="3" md="3" style="border-left: solid 1px black;background: #d9d9d9;padding: 0px;text-align: center;">محافظة </v-col>
                                        <v-col cols="3" md="3" style="border-left: solid 1px black;padding: 0px;">بغداد</v-col>
                                        <v-col cols="3" md="3" style="border-left: solid 1px black;background: #d9d9d9;padding: 0px;text-align: center;">شارع</v-col>
                                        <v-col cols="3" md="3" style="padding: 0px;"></v-col>
                                    </v-row>
                                    <v-row style="width: 100%;margin: 0px;">
                                        <v-col cols="3" md="3" style="border-left: solid 1px black;background: #d9d9d9;padding: 0px;">القضاء </v-col>
                                        <v-col cols="6" md="6" style="border-left: solid 1px black;padding: 0px;">الكاظمية <br> المقدسة</v-col>
                                        <v-col cols="3" md="3" style="border-left: solid 1px black;"></v-col>
                                    </v-row>
                                </v-col>
                            </v-row>
                            <v-row style="width: 100%;margin: 0px;border-bottom: solid 1px black;height: 190px;">
                                <v-col cols="3" md="3" style="border-left: solid 1px black;background: #d9d9d9;text-align: center;">توقيع</v-col>
                                <v-col cols="3" md="3" style="border-left: solid 1px black;padding: 0px;"></v-col>
                                <v-col cols="3" md="3" style="border-left: solid 1px black;background: #d9d9d9;text-align: center;">بصمة الابهام الايسر</v-col>
                                <v-col cols="3" md="3"></v-col>
                            </v-row>
                        </div>
                    </div>
                </v-col>
              </v-row>
            </div>
          </v-container>
          <v-container>
            <v-row
              style="
                display: flex;
                flex-direction: row;
                justify-content: space-between;
                align-items: center;
              "
            >
              <v-col
                cols="6"
                md="6"
                style="padding: 10px; text-align: right; white-space: pre-wrap"
                >توقيع الطرف الاول
              </v-col>
              <v-col
                cols="6"
                md="6"
                style="padding: 10px; text-align: left; white-space: pre-wrap"
              >
                توقيع الطرف الثاني
              </v-col>
            </v-row>
          </v-container>
        </v-card>
      </v-card>
      <v-card
        class="gd"
        :style="`background-image: url(${ba});background-position: center;background-repeat: no-repeat;background-size: auto;`"
      >
        <v-card
          style="
            background-color: rgb(255 255 255 / 0%);
            height: 100%;
            overflow: hidden;
            display: flex;
            flex-direction: column;
            justify-content: space-between;
          "
        >
          <v-container style="height: auto">
            <div class="diss" style="height: auto">
                <div style="height: 100%;">
                <h3 style="font-weight: 900; text-align: center">
                    مرفق رقم (1) جدول الدفعات والاقساط
                </h3>
                <br />
                <h3>
                    1-	بدل الشراء اتفق الطرفان الاول و الثاني على ان يكون سعر شراء المتر المربع الواحد( {{ numberWithComma(data.price_for_one_square_meter) }} ) وبذلك يكون السعر الاجمالي للشقة <br>( {{ numberWithComma(data.salary_amount) }} ) مليون دينار عراقي لا غير .
                </h3>
                <h3>
                    2-	تم دفع مبلغ ( {{ numberWithComma(data.salary_first_payment) }} ) مليون دينار عراقي لا غير بموجب الوصل المرقم   ({{ data.salary_owner_id }}) وبتاريخ  {{ d[0].date }}  كمقدمة شراء و الباقي على شكل دفعات.
                </h3>
                <br />
                <h3>
                        *سعر المتر    ({{ numberWithComma(data.price_for_one_square_meter) }}) مليون دينار عراقي لاغير.
                </h3>
                <br />
                <h3>
                        *مساحة الشقة ({{ data.house_total_space }}.م2).
                </h3>
                <br />
                <h3>
                        *سعر الشقة بالكامل({{ numberWithComma(data.salary_amount) }} د.ع) مليون دينار عراقي لاغير.   
                </h3>
                <table border="1" style="width: 100%;height: 100%;margin-bottom: 100px; border-collapse: collapse">
                        <thead>
                        <tr style="background-color: rgb(217 217 217)">
                            <th>رقم الدفعة </th>
                            <th>تاريخ الاستحقاق</th>
                            <th>مقدار الدفعة رقما</th>
                            <th>مقدار الدفعة كتابة</th>
                            <th>الملاحظات</th>
                        </tr>
                        </thead>
                        <tbody>
                        <tr v-for="(salary_payment, index) in sortedSalaryPayments" :key="index">
                            <td style="background-color: rgb(217 217 217)" v-if="salary_payment.payment_position == 'مقدم'">دفعة المقدمة 30%</td>
                            <td style="background-color: rgb(217 217 217)" v-else-if="salary_payment.payment_position == 'دفعة الهيكل'">دفعة الهيكل</td>
                            <td style="background-color: rgb(217 217 217)" v-else-if="salary_payment.payment_position == 'اخر دفعة'">الدفعة (دفعة التسليم) 21%</td>
                            <td style="background-color: rgb(217 217 217)" v-else>الدفعة ({{ getAdjustedIndex(index) }})</td>
                            <td>{{ salary_payment.date }}</td>
                            <td>{{ numberWithComma(salary_payment.amount) }}</td>
                            <td>{{ salary_payment.amount_written }}</td>
                            <td>{{ salary_payment.desc }}</td>
                        </tr>
                        </tbody>
                    </table>
                </div>
            </div>
            <br>
            <br>
            <br>
            <div style="width: 100%;height: 200px;border: solid 1px black;">
                * ملاحظه
            </div>
          </v-container>
          <v-container>
            <v-row
              style="
                display: flex;
                flex-direction: row;
                justify-content: space-between;
                align-items: center;
              "
            >
              <v-col
                cols="6"
                md="6"
                style="padding: 10px; text-align: right; white-space: pre-wrap"
                >توقيع الطرف الاول
              </v-col>
              <v-col
                cols="6"
                md="6"
                style="padding: 10px; text-align: left; white-space: pre-wrap"
              >
                توقيع الطرف الثاني
              </v-col>
            </v-row>
          </v-container>
        </v-card>
      </v-card>
      <!-- <v-card
        class="gdd"
        :style="`background-image: url(${ba});background-position: center;background-repeat: no-repeat;background-size: auto;`"
      >
        <v-card
          style="
            background-color: rgb(255 255 255 / 0%);
            height: 100%;
            overflow: hidden;
            display: flex;
            flex-direction: column;
            justify-content: space-between;
            border: solid 3px black;
          "
        >
          <v-container>
            <br />
            <br />
            <div>
              <h3 style="font-weight: 900; text-align: center">المرفق رقم 2</h3>
              <br />
              <h3 style="font-weight: 900; text-align: center"> المخططات الهندسية للشقة</h3>
            </div>
          </v-container>
          <v-container>
            <v-row
              style="
                display: flex;
                flex-direction: row;
                justify-content: space-between;
                align-items: center;
              "
            >
              <v-col
                cols="6"
                md="6"
                style="padding: 10px; text-align: right; white-space: pre-wrap"
                >توقيع الطرف الاول
              </v-col>
              <v-col
                cols="6"
                md="6"
                style="padding: 10px; text-align: left; white-space: pre-wrap"
              >
                توقيع الطرف الثاني
              </v-col>
            </v-row>
          </v-container>
        </v-card>
      </v-card> -->
      <v-card
        class="gdd"
        :style="`background-image: url(${ba});background-position: center;background-repeat: no-repeat;background-size: auto;`"
      >
        <v-card
          style="
            background-color: rgb(255 255 255 / 0%);
            height: 100%;
            overflow: hidden;
            display: flex;
            flex-direction: column;
            justify-content: space-between;
          "
        >
          <v-container>
            <br />
            <br />
            <div>
              <h3 style="font-weight: 900; text-align: center">المرفق رقم 3</h3>
              <br />
              <h3 style="font-weight: 900; text-align: center"> المواصفات الخاصة بالشقة عند الاستلام</h3>
              <p>
                تتضمن الوحدة السكنية التجهيزات الاتية
                <ul style="list-style-type: none;margin-right: 15px;">
                    <li>-	أبواب مدخل قاصة منشا تركي.</li>
                    <li>-	أبواب داخلية من الخشب منشا تركي.</li>
                    <li>-	الشبابيك من نوع الزجاج المزدوج (دبل جام) المنيوم عازل للصوت و الحرارة منشا تركي.</li>
                    <li>-	ارضيات من نوع بورسلين منشا تركي .</li>
                    <li>-	الشقة مجهزة بنظام الغاز السائل المركزي.</li>
                    <li>-	الشقة مجهزة بنظام تبريد و تدفئة خاص لكل شقة وفق نظام (VRF) من نوعية (Gree).</li>
                    <li>-	الشقة مجهزة بمنظومة استقبال البث التلفزيوني الرقمي و خدمة الانترنت.</li>
                    <li>-	العمارات مجهزة بمصاعد من المناشئ الامريكية.</li>
                    <li>-	الصحيات نوعية (Vitra) </li>
                    <li>-	المطبخ مجهز بكاونتر.</li>
                    <li>-	السقوف مغربية.</li>
                    <li>-	الكهربائيات (سويج بلك) نوعية (Legrand) الفرنسية.</li>
                    <li>-	وجود سوبر ماركت و كافة الاحتياجات اليومية المطلوبة.</li>
                    <li>-	وجود محطة تكسيات تابعة للمجمع.</li>
                    <li>-	تجهيز الابنية بنظام الحريق المركزي</li>
                    <li>-	توفير ملاعب للاطفال مع مساحات للرياضة الخارجية.</li>
                    <li>-	توفير حضانة و روضة ومدرسة خاصة.</li>
                    <li>-	توفير شركات امنية لحماية امن المجمع.</li>
                    <li>-	توفير نظام كامرات مراقبة.</li>
                    <li>-	توفير جهاز تحكم سبيكر متصل بالمدخل الرئيسي للمجمع.</li>
                    <li>-	تجهيز السخانات.</li>
                </ul>
              </p>
            </div>
          </v-container>
          <v-container>
            <v-row
              style="
                display: flex;
                flex-direction: row;
                justify-content: space-between;
                align-items: center;
              "
            >
              <v-col
                cols="6"
                md="6"
                style="padding: 10px; text-align: right; white-space: pre-wrap"
                >توقيع الطرف الاول
              </v-col>
              <v-col
                cols="6"
                md="6"
                style="padding: 10px; text-align: left; white-space: pre-wrap"
              >
                توقيع الطرف الثاني
              </v-col>
            </v-row>
          </v-container>
        </v-card>
      </v-card>
      <v-card
        class="gdd"
        :style="`background-image: url(${ba});background-position: center;background-repeat: no-repeat;background-size: auto;`"
      >
        <v-card
          style="
            background-color: rgb(255 255 255 / 0%);
            height: 100%;
            overflow: hidden;
            display: flex;
            flex-direction: column;
            justify-content: space-between;
          "
        >
          <v-container>
            <br />
            <br />
            <div>
            </div>
          </v-container>
          <v-container>
            <v-row
              style="
                display: flex;
                flex-direction: row;
                justify-content: space-between;
                align-items: center;
              "
            >
              <v-col
                cols="6"
                md="6"
                style="padding: 10px; text-align: right; white-space: pre-wrap"
                >توقيع الطرف الاول
              </v-col>
              <v-col
                cols="6"
                md="6"
                style="padding: 10px; text-align: left; white-space: pre-wrap"
              >
                توقيع الطرف الثاني
              </v-col>
            </v-row>
          </v-container>
        </v-card>
      </v-card>
    </v-container>
  </div>
</template>

<script>
import logoPrint from "@/assets/images/icons/logoPrint.png";
import ba from "@/assets/images/icons/aba.jpg";
import numberWithComma from "@/constant/number";

export default {
  data() {
    return {
      data: {},
      user: null,
      ba,
      logoPrint,
      d: null,
    };
  },
  created() {
    this.data = JSON.parse(localStorage.getItem("PrintAbsly"));
    this.user = JSON.parse(localStorage.getItem("results"));

    if (this.data.first_payment_date && this.data.last_payment_date) {
      this.yearsDifference = this.getMonthsDifference(
        this.data.first_payment_date,
        this.data.last_payment_date
      );
    }
    this.d = this.data.salary_payments.filter(
      (payment) => payment.payment_position === "مقدم"
    );
  },
  computed: {
    sortedSalaryPayments() {
      const getPaymentWeight = (payment_position) => {
        switch (payment_position) {
          case "مقدم":
            return 1;
          case "دفعة الهيكل":
            return 2;
          default:
            return 3;
        }
      };

      return this.data.salary_payments.slice().sort((a, b) => {
        return (
          getPaymentWeight(a.payment_position) -
          getPaymentWeight(b.payment_position)
        );
      });
    },
  },
  mounted() {
    setTimeout(() => {
      this.printElement();
    }, 500);
  },
  methods: {
    numberWithComma,
    getMonthsDifference(startDate, endDate) {
      const start = new Date(startDate);
      const end = new Date(endDate);

      const yearsDifference = end.getFullYear() - start.getFullYear();
      const monthsDifference = end.getMonth() - start.getMonth();

      return yearsDifference * 12 + monthsDifference;
    },
    getAdjustedIndex(index) {
      const structurePaymentIndex = this.sortedSalaryPayments.findIndex(
        (payment) => payment.payment_position === "دفعة الهيكل"
      );

      if (structurePaymentIndex === -1 || index <= structurePaymentIndex) {
        return index + 1;
      } else {
        return index - structurePaymentIndex;
      }
    },

    printElement() {
      var printContent = document.getElementById("pri").innerHTML;
      var originalContent = document.body.innerHTML;
      var originalStyle = document.head.innerHTML;

      document.body.innerHTML = printContent;

      window.print();

      document.body.innerHTML = originalContent;
      document.head.innerHTML = originalStyle;

      setTimeout(() => {
        this.printing = false;
      }, 100);
    },
  },
};
</script>

<style>
.v-card {
  margin-bottom: 15px;
  height: auto;
}

@media print {
  @media print {
    table {
      page-break-inside: auto;
    }

    body {
      direction: rtl;
    }
    #pri v-card-title v-row {
      display: flex;
      align-items: center;
      justify-content: space-around;
      flex-direction: row;
    }
    .gdd {
      margin-bottom: 0px;
      height: 100vh;
      page-break-before: always;
    }
    .gd {
      margin-bottom: 0px;
      height: auto;
      page-break-before: always;
    }
    .dis {
      display: flex !important;
      flex-direction: column !important;
      justify-content: space-between !important;
      height: 100% !important;
    }
    .diss {
      display: flex !important;
      flex-direction: column !important;
      justify-content: space-between !important;
      height: auto !important;
    }
    .gdd:first-child {
      page-break-before: auto;
    }
    table {
      page-break-inside: auto;
    }
    tr {
      page-break-inside: avoid;
      page-break-after: auto;
    }
    td,
    th {
      page-break-inside: avoid;
      page-break-after: auto;
    }
  }
}
</style>
